Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
/*
 * Component description for CFG
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_CFG_COMPONENT_H_
#define _PIC32WM_BZ6_CFG_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR CFG                       */
/* ************************************************************************** */

/* -------- CFG_CFGCON0 : (CFG Offset: 0x00) (R/W 32)  -------- */
#define CFG_CFGCON0_RESETVALUE                _UINT32_(0x7960000B)                                 /*  (CFG_CFGCON0)   Reset Value */

#define CFG_CFGCON0_SWOEN_Pos                 _UINT32_(1)                                          /* (CFG_CFGCON0) SWO enable on 2-wire debug interface Position */
#define CFG_CFGCON0_SWOEN_Msk                 (_UINT32_(0x1) << CFG_CFGCON0_SWOEN_Pos)             /* (CFG_CFGCON0) SWO enable on 2-wire debug interface Mask */
#define CFG_CFGCON0_SWOEN(value)              (CFG_CFGCON0_SWOEN_Msk & (_UINT32_(value) << CFG_CFGCON0_SWOEN_Pos)) /* Assignment of value for SWOEN in the CFG_CFGCON0 register */
#define CFG_CFGCON0_TROEN_Pos                 _UINT32_(2)                                          /* (CFG_CFGCON0) Trace Output Enable Position */
#define CFG_CFGCON0_TROEN_Msk                 (_UINT32_(0x1) << CFG_CFGCON0_TROEN_Pos)             /* (CFG_CFGCON0) Trace Output Enable Mask */
#define CFG_CFGCON0_TROEN(value)              (CFG_CFGCON0_TROEN_Msk & (_UINT32_(value) << CFG_CFGCON0_TROEN_Pos)) /* Assignment of value for TROEN in the CFG_CFGCON0 register */
#define CFG_CFGCON0_JTAGEN_Pos                _UINT32_(3)                                          /* (CFG_CFGCON0) JTAG Enable Position */
#define CFG_CFGCON0_JTAGEN_Msk                (_UINT32_(0x1) << CFG_CFGCON0_JTAGEN_Pos)            /* (CFG_CFGCON0) JTAG Enable Mask */
#define CFG_CFGCON0_JTAGEN(value)             (CFG_CFGCON0_JTAGEN_Msk & (_UINT32_(value) << CFG_CFGCON0_JTAGEN_Pos)) /* Assignment of value for JTAGEN in the CFG_CFGCON0 register */
#define CFG_CFGCON0_ADCPOVR_Pos               _UINT32_(4)                                          /* (CFG_CFGCON0) ADC Charge Pump Override Position */
#define CFG_CFGCON0_ADCPOVR_Msk               (_UINT32_(0x1) << CFG_CFGCON0_ADCPOVR_Pos)           /* (CFG_CFGCON0) ADC Charge Pump Override Mask */
#define CFG_CFGCON0_ADCPOVR(value)            (CFG_CFGCON0_ADCPOVR_Msk & (_UINT32_(value) << CFG_CFGCON0_ADCPOVR_Pos)) /* Assignment of value for ADCPOVR in the CFG_CFGCON0 register */
#define CFG_CFGCON0_CPENFILT_Pos              _UINT32_(7)                                          /* (CFG_CFGCON0) ADC CP Filter Enable Position */
#define CFG_CFGCON0_CPENFILT_Msk              (_UINT32_(0x1) << CFG_CFGCON0_CPENFILT_Pos)          /* (CFG_CFGCON0) ADC CP Filter Enable Mask */
#define CFG_CFGCON0_CPENFILT(value)           (CFG_CFGCON0_CPENFILT_Msk & (_UINT32_(value) << CFG_CFGCON0_CPENFILT_Pos)) /* Assignment of value for CPENFILT in the CFG_CFGCON0 register */
#define CFG_CFGCON0_RTCIN0_ALTEN_Pos          _UINT32_(8)                                          /* (CFG_CFGCON0) RTCIN0 Alternate Enable Position */
#define CFG_CFGCON0_RTCIN0_ALTEN_Msk          (_UINT32_(0x1) << CFG_CFGCON0_RTCIN0_ALTEN_Pos)      /* (CFG_CFGCON0) RTCIN0 Alternate Enable Mask */
#define CFG_CFGCON0_RTCIN0_ALTEN(value)       (CFG_CFGCON0_RTCIN0_ALTEN_Msk & (_UINT32_(value) << CFG_CFGCON0_RTCIN0_ALTEN_Pos)) /* Assignment of value for RTCIN0_ALTEN in the CFG_CFGCON0 register */
#define CFG_CFGCON0_RTCOUT_ALTEN_Pos          _UINT32_(9)                                          /* (CFG_CFGCON0) RTCOUT Alternate Enable Position */
#define CFG_CFGCON0_RTCOUT_ALTEN_Msk          (_UINT32_(0x1) << CFG_CFGCON0_RTCOUT_ALTEN_Pos)      /* (CFG_CFGCON0) RTCOUT Alternate Enable Mask */
#define CFG_CFGCON0_RTCOUT_ALTEN(value)       (CFG_CFGCON0_RTCOUT_ALTEN_Msk & (_UINT32_(value) << CFG_CFGCON0_RTCOUT_ALTEN_Pos)) /* Assignment of value for RTCOUT_ALTEN in the CFG_CFGCON0 register */
#define CFG_CFGCON0_PMULOCK_Pos               _UINT32_(10)                                         /* (CFG_CFGCON0) PMU Controller Register LOCK Position */
#define CFG_CFGCON0_PMULOCK_Msk               (_UINT32_(0x1) << CFG_CFGCON0_PMULOCK_Pos)           /* (CFG_CFGCON0) PMU Controller Register LOCK Mask */
#define CFG_CFGCON0_PMULOCK(value)            (CFG_CFGCON0_PMULOCK_Msk & (_UINT32_(value) << CFG_CFGCON0_PMULOCK_Pos)) /* Assignment of value for PMULOCK in the CFG_CFGCON0 register */
#define CFG_CFGCON0_PGLCOK_Pos                _UINT32_(11)                                         /* (CFG_CFGCON0) Permission Group LOCK Position */
#define CFG_CFGCON0_PGLCOK_Msk                (_UINT32_(0x1) << CFG_CFGCON0_PGLCOK_Pos)            /* (CFG_CFGCON0) Permission Group LOCK Mask */
#define CFG_CFGCON0_PGLCOK(value)             (CFG_CFGCON0_PGLCOK_Msk & (_UINT32_(value) << CFG_CFGCON0_PGLCOK_Pos)) /* Assignment of value for PGLCOK in the CFG_CFGCON0 register */
#define CFG_CFGCON0_PMDLOCK_Pos               _UINT32_(12)                                         /* (CFG_CFGCON0) Peripheral Module Disable (PMD) LOCK Position */
#define CFG_CFGCON0_PMDLOCK_Msk               (_UINT32_(0x1) << CFG_CFGCON0_PMDLOCK_Pos)           /* (CFG_CFGCON0) Peripheral Module Disable (PMD) LOCK Mask */
#define CFG_CFGCON0_PMDLOCK(value)            (CFG_CFGCON0_PMDLOCK_Msk & (_UINT32_(value) << CFG_CFGCON0_PMDLOCK_Pos)) /* Assignment of value for PMDLOCK in the CFG_CFGCON0 register */
#define CFG_CFGCON0_IOLOCK_Pos                _UINT32_(13)                                         /* (CFG_CFGCON0) IO LOCK Position */
#define CFG_CFGCON0_IOLOCK_Msk                (_UINT32_(0x1) << CFG_CFGCON0_IOLOCK_Pos)            /* (CFG_CFGCON0) IO LOCK Mask */
#define CFG_CFGCON0_IOLOCK(value)             (CFG_CFGCON0_IOLOCK_Msk & (_UINT32_(value) << CFG_CFGCON0_IOLOCK_Pos)) /* Assignment of value for IOLOCK in the CFG_CFGCON0 register */
#define CFG_CFGCON0_CFGCLOCK_Pos              _UINT32_(14)                                         /* (CFG_CFGCON0) Configuration Register Lock Position */
#define CFG_CFGCON0_CFGCLOCK_Msk              (_UINT32_(0x3) << CFG_CFGCON0_CFGCLOCK_Pos)          /* (CFG_CFGCON0) Configuration Register Lock Mask */
#define CFG_CFGCON0_CFGCLOCK(value)           (CFG_CFGCON0_CFGCLOCK_Msk & (_UINT32_(value) << CFG_CFGCON0_CFGCLOCK_Pos)) /* Assignment of value for CFGCLOCK in the CFG_CFGCON0 register */
#define CFG_CFGCON0_USBSSEN_Pos               _UINT32_(17)                                         /* (CFG_CFGCON0) USB Suspend Sleep Enable Position */
#define CFG_CFGCON0_USBSSEN_Msk               (_UINT32_(0x1) << CFG_CFGCON0_USBSSEN_Pos)           /* (CFG_CFGCON0) USB Suspend Sleep Enable Mask */
#define CFG_CFGCON0_USBSSEN(value)            (CFG_CFGCON0_USBSSEN_Msk & (_UINT32_(value) << CFG_CFGCON0_USBSSEN_Pos)) /* Assignment of value for USBSSEN in the CFG_CFGCON0 register */
#define CFG_CFGCON0_EPLLHWMD_Pos              _UINT32_(18)                                         /* (CFG_CFGCON0) EWPLL HW Control Mode for PWDN and RESET Position */
#define CFG_CFGCON0_EPLLHWMD_Msk              (_UINT32_(0x1) << CFG_CFGCON0_EPLLHWMD_Pos)          /* (CFG_CFGCON0) EWPLL HW Control Mode for PWDN and RESET Mask */
#define CFG_CFGCON0_EPLLHWMD(value)           (CFG_CFGCON0_EPLLHWMD_Msk & (_UINT32_(value) << CFG_CFGCON0_EPLLHWMD_Pos)) /* Assignment of value for EPLLHWMD in the CFG_CFGCON0 register */
#define CFG_CFGCON0_UPLLHWMD_Pos              _UINT32_(19)                                         /* (CFG_CFGCON0) UWPLL HW Control Mode for PWDN and RESET Position */
#define CFG_CFGCON0_UPLLHWMD_Msk              (_UINT32_(0x1) << CFG_CFGCON0_UPLLHWMD_Pos)          /* (CFG_CFGCON0) UWPLL HW Control Mode for PWDN and RESET Mask */
#define CFG_CFGCON0_UPLLHWMD(value)           (CFG_CFGCON0_UPLLHWMD_Msk & (_UINT32_(value) << CFG_CFGCON0_UPLLHWMD_Pos)) /* Assignment of value for UPLLHWMD in the CFG_CFGCON0 register */
#define CFG_CFGCON0_HPLUGDIS_Pos              _UINT32_(20)                                         /* (CFG_CFGCON0) Hot Plugging Disable (Outside Fuse Loading) Position */
#define CFG_CFGCON0_HPLUGDIS_Msk              (_UINT32_(0x1) << CFG_CFGCON0_HPLUGDIS_Pos)          /* (CFG_CFGCON0) Hot Plugging Disable (Outside Fuse Loading) Mask */
#define CFG_CFGCON0_HPLUGDIS(value)           (CFG_CFGCON0_HPLUGDIS_Msk & (_UINT32_(value) << CFG_CFGCON0_HPLUGDIS_Pos)) /* Assignment of value for HPLUGDIS in the CFG_CFGCON0 register */
#define CFG_CFGCON0_USBIDIO_Pos               _UINT32_(21)                                         /* (CFG_CFGCON0) USB USBID Selection bit Position */
#define CFG_CFGCON0_USBIDIO_Msk               (_UINT32_(0x1) << CFG_CFGCON0_USBIDIO_Pos)           /* (CFG_CFGCON0) USB USBID Selection bit Mask */
#define CFG_CFGCON0_USBIDIO(value)            (CFG_CFGCON0_USBIDIO_Msk & (_UINT32_(value) << CFG_CFGCON0_USBIDIO_Pos)) /* Assignment of value for USBIDIO in the CFG_CFGCON0 register */
#define CFG_CFGCON0_VBUSONIO_Pos              _UINT32_(22)                                         /* (CFG_CFGCON0) USB VBUS_ON Selection bit Position */
#define CFG_CFGCON0_VBUSONIO_Msk              (_UINT32_(0x1) << CFG_CFGCON0_VBUSONIO_Pos)          /* (CFG_CFGCON0) USB VBUS_ON Selection bit Mask */
#define CFG_CFGCON0_VBUSONIO(value)           (CFG_CFGCON0_VBUSONIO_Msk & (_UINT32_(value) << CFG_CFGCON0_VBUSONIO_Pos)) /* Assignment of value for VBUSONIO in the CFG_CFGCON0 register */
#define CFG_CFGCON0_SMBUS3EN2_Pos             _UINT32_(23)                                         /* (CFG_CFGCON0) SMBus3 Enable for SERCOM2 Position */
#define CFG_CFGCON0_SMBUS3EN2_Msk             (_UINT32_(0x1) << CFG_CFGCON0_SMBUS3EN2_Pos)         /* (CFG_CFGCON0) SMBus3 Enable for SERCOM2 Mask */
#define CFG_CFGCON0_SMBUS3EN2(value)          (CFG_CFGCON0_SMBUS3EN2_Msk & (_UINT32_(value) << CFG_CFGCON0_SMBUS3EN2_Pos)) /* Assignment of value for SMBUS3EN2 in the CFG_CFGCON0 register */
#define CFG_CFGCON0_PCM_Pos                   _UINT32_(24)                                         /* (CFG_CFGCON0) PCHE I/D Cacheable Mode Position */
#define CFG_CFGCON0_PCM_Msk                   (_UINT32_(0x1) << CFG_CFGCON0_PCM_Pos)               /* (CFG_CFGCON0) PCHE I/D Cacheable Mode Mask */
#define CFG_CFGCON0_PCM(value)                (CFG_CFGCON0_PCM_Msk & (_UINT32_(value) << CFG_CFGCON0_PCM_Pos)) /* Assignment of value for PCM in the CFG_CFGCON0 register */
#define CFG_CFGCON0_INT0E_Pos                 _UINT32_(25)                                         /* (CFG_CFGCON0) INT0 Enable Position */
#define CFG_CFGCON0_INT0E_Msk                 (_UINT32_(0x1) << CFG_CFGCON0_INT0E_Pos)             /* (CFG_CFGCON0) INT0 Enable Mask */
#define CFG_CFGCON0_INT0E(value)              (CFG_CFGCON0_INT0E_Msk & (_UINT32_(value) << CFG_CFGCON0_INT0E_Pos)) /* Assignment of value for INT0E in the CFG_CFGCON0 register */
#define CFG_CFGCON0_INT0P_Pos                 _UINT32_(26)                                         /* (CFG_CFGCON0) INT0P Polarity Position */
#define CFG_CFGCON0_INT0P_Msk                 (_UINT32_(0x1) << CFG_CFGCON0_INT0P_Pos)             /* (CFG_CFGCON0) INT0P Polarity Mask */
#define CFG_CFGCON0_INT0P(value)              (CFG_CFGCON0_INT0P_Msk & (_UINT32_(value) << CFG_CFGCON0_INT0P_Pos)) /* Assignment of value for INT0P in the CFG_CFGCON0 register */
#define CFG_CFGCON0_CMEN_Pos                  _UINT32_(27)                                         /* (CFG_CFGCON0) SPA/DPA Countermeasures Enable Position */
#define CFG_CFGCON0_CMEN_Msk                  (_UINT32_(0x1) << CFG_CFGCON0_CMEN_Pos)              /* (CFG_CFGCON0) SPA/DPA Countermeasures Enable Mask */
#define CFG_CFGCON0_CMEN(value)               (CFG_CFGCON0_CMEN_Msk & (_UINT32_(value) << CFG_CFGCON0_CMEN_Pos)) /* Assignment of value for CMEN in the CFG_CFGCON0 register */
#define CFG_CFGCON0_FECCCON_Pos               _UINT32_(28)                                         /* (CFG_CFGCON0) Flash ECC Control Position */
#define CFG_CFGCON0_FECCCON_Msk               (_UINT32_(0x3) << CFG_CFGCON0_FECCCON_Pos)           /* (CFG_CFGCON0) Flash ECC Control Mask */
#define CFG_CFGCON0_FECCCON(value)            (CFG_CFGCON0_FECCCON_Msk & (_UINT32_(value) << CFG_CFGCON0_FECCCON_Pos)) /* Assignment of value for FECCCON in the CFG_CFGCON0 register */
#define CFG_CFGCON0_FRECCDIS_Pos              _UINT32_(30)                                         /* (CFG_CFGCON0) Flex RAM ECC Control Position */
#define CFG_CFGCON0_FRECCDIS_Msk              (_UINT32_(0x1) << CFG_CFGCON0_FRECCDIS_Pos)          /* (CFG_CFGCON0) Flex RAM ECC Control Mask */
#define CFG_CFGCON0_FRECCDIS(value)           (CFG_CFGCON0_FRECCDIS_Msk & (_UINT32_(value) << CFG_CFGCON0_FRECCDIS_Pos)) /* Assignment of value for FRECCDIS in the CFG_CFGCON0 register */
#define CFG_CFGCON0_Msk                       _UINT32_(0x7FFEFF9E)                                 /* (CFG_CFGCON0) Register Mask  */

