Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define CFG_CFGCON4_SOSC_CFG_Pos              _UINT32_(0)                                          /* (CFG_CFGCON4) SOSC Configuration Position */
#define CFG_CFGCON4_SOSC_CFG_Msk              (_UINT32_(0xFF) << CFG_CFGCON4_SOSC_CFG_Pos)         /* (CFG_CFGCON4) SOSC Configuration Mask */
#define CFG_CFGCON4_SOSC_CFG(value)           (CFG_CFGCON4_SOSC_CFG_Msk & (_UINT32_(value) << CFG_CFGCON4_SOSC_CFG_Pos)) /* Assignment of value for SOSC_CFG in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCEVENT_SEL_Pos          _UINT32_(8)                                          /* (CFG_CFGCON4) RTC Event Selection Position */
#define CFG_CFGCON4_RTCEVENT_SEL_Msk          (_UINT32_(0x3) << CFG_CFGCON4_RTCEVENT_SEL_Pos)      /* (CFG_CFGCON4) RTC Event Selection Mask */
#define CFG_CFGCON4_RTCEVENT_SEL(value)       (CFG_CFGCON4_RTCEVENT_SEL_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCEVENT_SEL_Pos)) /* Assignment of value for RTCEVENT_SEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCEVENT_EN_Pos           _UINT32_(10)                                         /* (CFG_CFGCON4) Pad Output Enable for MCHP legacy RTC event output Position */
#define CFG_CFGCON4_RTCEVENT_EN_Msk           (_UINT32_(0x1) << CFG_CFGCON4_RTCEVENT_EN_Pos)       /* (CFG_CFGCON4) Pad Output Enable for MCHP legacy RTC event output Mask */
#define CFG_CFGCON4_RTCEVENT_EN(value)        (CFG_CFGCON4_RTCEVENT_EN_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCEVENT_EN_Pos)) /* Assignment of value for RTCEVENT_EN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_VBKP_1KCSEL_Pos           _UINT32_(11)                                         /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Selection Position */
#define CFG_CFGCON4_VBKP_1KCSEL_Msk           (_UINT32_(0x1) << CFG_CFGCON4_VBKP_1KCSEL_Pos)       /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Selection Mask */
#define CFG_CFGCON4_VBKP_1KCSEL(value)        (CFG_CFGCON4_VBKP_1KCSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_VBKP_1KCSEL_Pos)) /* Assignment of value for VBKP_1KCSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_VBKP_32KCSEL_Pos          _UINT32_(12)                                         /* (CFG_CFGCON4) VDDBUKPCORE 32KHz clock source selection Position */
#define CFG_CFGCON4_VBKP_32KCSEL_Msk          (_UINT32_(0x3) << CFG_CFGCON4_VBKP_32KCSEL_Pos)      /* (CFG_CFGCON4) VDDBUKPCORE 32KHz clock source selection Mask */
#define CFG_CFGCON4_VBKP_32KCSEL(value)       (CFG_CFGCON4_VBKP_32KCSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_VBKP_32KCSEL_Pos)) /* Assignment of value for VBKP_32KCSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_VBKP_DIVSEL_Pos           _UINT32_(14)                                         /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Divider Selection Position */
#define CFG_CFGCON4_VBKP_DIVSEL_Msk           (_UINT32_(0x1) << CFG_CFGCON4_VBKP_DIVSEL_Pos)       /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Divider Selection Mask */
#define CFG_CFGCON4_VBKP_DIVSEL(value)        (CFG_CFGCON4_VBKP_DIVSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_VBKP_DIVSEL_Pos)) /* Assignment of value for VBKP_DIVSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_LPCLK_MOD_Pos             _UINT32_(15)                                         /* (CFG_CFGCON4) LPCLK modifier in counter/delay mode Position */
#define CFG_CFGCON4_LPCLK_MOD_Msk             (_UINT32_(0x1) << CFG_CFGCON4_LPCLK_MOD_Pos)         /* (CFG_CFGCON4) LPCLK modifier in counter/delay mode Mask */
#define CFG_CFGCON4_LPCLK_MOD(value)          (CFG_CFGCON4_LPCLK_MOD_Msk & (_UINT32_(value) << CFG_CFGCON4_LPCLK_MOD_Pos)) /* Assignment of value for LPCLK_MOD in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCEVTYPE_Pos             _UINT32_(16)                                         /* (CFG_CFGCON4) RTC Event Type Position */
#define CFG_CFGCON4_RTCEVTYPE_Msk             (_UINT32_(0x1) << CFG_CFGCON4_RTCEVTYPE_Pos)         /* (CFG_CFGCON4) RTC Event Type Mask */
#define CFG_CFGCON4_RTCEVTYPE(value)          (CFG_CFGCON4_RTCEVTYPE_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCEVTYPE_Pos)) /* Assignment of value for RTCEVTYPE in the CFG_CFGCON4 register */
#define CFG_CFGCON4_CPEN_DLY_Pos              _UINT32_(17)                                         /* (CFG_CFGCON4) Charge-pump ready digital delay Position */
#define CFG_CFGCON4_CPEN_DLY_Msk              (_UINT32_(0x7) << CFG_CFGCON4_CPEN_DLY_Pos)          /* (CFG_CFGCON4) Charge-pump ready digital delay Mask */
#define CFG_CFGCON4_CPEN_DLY(value)           (CFG_CFGCON4_CPEN_DLY_Msk & (_UINT32_(value) << CFG_CFGCON4_CPEN_DLY_Pos)) /* Assignment of value for CPEN_DLY in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSZPBOREN_Pos             _UINT32_(20)                                         /* (CFG_CFGCON4) Deep Sleep Zero-Power BOR Enable Position */
#define CFG_CFGCON4_DSZPBOREN_Msk             (_UINT32_(0x1) << CFG_CFGCON4_DSZPBOREN_Pos)         /* (CFG_CFGCON4) Deep Sleep Zero-Power BOR Enable Mask */
#define CFG_CFGCON4_DSZPBOREN(value)          (CFG_CFGCON4_DSZPBOREN_Msk & (_UINT32_(value) << CFG_CFGCON4_DSZPBOREN_Pos)) /* Assignment of value for DSZPBOREN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSWDTPS_Pos               _UINT32_(21)                                         /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Postscale Select Position */
#define CFG_CFGCON4_DSWDTPS_Msk               (_UINT32_(0x1F) << CFG_CFGCON4_DSWDTPS_Pos)          /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Postscale Select Mask */
#define CFG_CFGCON4_DSWDTPS(value)            (CFG_CFGCON4_DSWDTPS_Msk & (_UINT32_(value) << CFG_CFGCON4_DSWDTPS_Pos)) /* Assignment of value for DSWDTPS in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSWDTOSC_Pos              _UINT32_(26)                                         /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Reference Clock Select Position */
#define CFG_CFGCON4_DSWDTOSC_Msk              (_UINT32_(0x1) << CFG_CFGCON4_DSWDTOSC_Pos)          /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Reference Clock Select Mask */
#define CFG_CFGCON4_DSWDTOSC(value)           (CFG_CFGCON4_DSWDTOSC_Msk & (_UINT32_(value) << CFG_CFGCON4_DSWDTOSC_Pos)) /* Assignment of value for DSWDTOSC in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSWDTEN_Pos               _UINT32_(27)                                         /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Enable Position */
#define CFG_CFGCON4_DSWDTEN_Msk               (_UINT32_(0x1) << CFG_CFGCON4_DSWDTEN_Pos)           /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Enable Mask */
#define CFG_CFGCON4_DSWDTEN(value)            (CFG_CFGCON4_DSWDTEN_Msk & (_UINT32_(value) << CFG_CFGCON4_DSWDTEN_Pos)) /* Assignment of value for DSWDTEN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSEN_Pos                  _UINT32_(28)                                         /* (CFG_CFGCON4) Deep Sleep Bit Enable Position */
#define CFG_CFGCON4_DSEN_Msk                  (_UINT32_(0x1) << CFG_CFGCON4_DSEN_Pos)              /* (CFG_CFGCON4) Deep Sleep Bit Enable Mask */
#define CFG_CFGCON4_DSEN(value)               (CFG_CFGCON4_DSEN_Msk & (_UINT32_(value) << CFG_CFGCON4_DSEN_Pos)) /* Assignment of value for DSEN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_UVREGROVR_Pos             _UINT32_(29)                                         /* (CFG_CFGCON4) ULPVREG Retention Mode Override Position */
#define CFG_CFGCON4_UVREGROVR_Msk             (_UINT32_(0x1) << CFG_CFGCON4_UVREGROVR_Pos)         /* (CFG_CFGCON4) ULPVREG Retention Mode Override Mask */
#define CFG_CFGCON4_UVREGROVR(value)          (CFG_CFGCON4_UVREGROVR_Msk & (_UINT32_(value) << CFG_CFGCON4_UVREGROVR_Pos)) /* Assignment of value for UVREGROVR in the CFG_CFGCON4 register */
#define CFG_CFGCON4_LPOSCEN_Pos               _UINT32_(30)                                         /* (CFG_CFGCON4) Low Power (Secondary) Oscillator Enable Position */
#define CFG_CFGCON4_LPOSCEN_Msk               (_UINT32_(0x1) << CFG_CFGCON4_LPOSCEN_Pos)           /* (CFG_CFGCON4) Low Power (Secondary) Oscillator Enable Mask */
#define CFG_CFGCON4_LPOSCEN(value)            (CFG_CFGCON4_LPOSCEN_Msk & (_UINT32_(value) << CFG_CFGCON4_LPOSCEN_Pos)) /* Assignment of value for LPOSCEN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCNTM_CSEL_Pos           _UINT32_(31)                                         /* (CFG_CFGCON4) RTC Counter Mode Clock Select Position */
#define CFG_CFGCON4_RTCNTM_CSEL_Msk           (_UINT32_(0x1) << CFG_CFGCON4_RTCNTM_CSEL_Pos)       /* (CFG_CFGCON4) RTC Counter Mode Clock Select Mask */
#define CFG_CFGCON4_RTCNTM_CSEL(value)        (CFG_CFGCON4_RTCNTM_CSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCNTM_CSEL_Pos)) /* Assignment of value for RTCNTM_CSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGCON4) Register Mask  */


/* -------- CFG_CFGCON4CLR : (CFG Offset: 0x44) (R/W 32) Bit clear register -------- */
#define CFG_CFGCON4CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON4CLR) Bit clear register  Reset Value */

#define CFG_CFGCON4CLR_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON4CLR) Register Mask  */


/* -------- CFG_CFGCON4SET : (CFG Offset: 0x48) (R/W 32) Bit set register -------- */
#define CFG_CFGCON4SET_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON4SET) Bit set register  Reset Value */

#define CFG_CFGCON4SET_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON4SET) Register Mask  */


/* -------- CFG_CFGCON4INV : (CFG Offset: 0x4C) (R/W 32) Bit invert register -------- */
#define CFG_CFGCON4INV_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON4INV) Bit invert register  Reset Value */

#define CFG_CFGCON4INV_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON4INV) Register Mask  */


/* -------- CFG_CFGPGQOS1 : (CFG Offset: 0x50) (R/W 32)  -------- */
#define CFG_CFGPGQOS1_RESETVALUE              _UINT32_(0xE040004C)                                 /*  (CFG_CFGPGQOS1)   Reset Value */

#define CFG_CFGPGQOS1_CPUPG_Pos               _UINT32_(0)                                          /* (CFG_CFGPGQOS1) CPU (Code) Permission Group Position */
#define CFG_CFGPGQOS1_CPUPG_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS1_CPUPG_Pos)           /* (CFG_CFGPGQOS1) CPU (Code) Permission Group Mask */
#define CFG_CFGPGQOS1_CPUPG(value)            (CFG_CFGPGQOS1_CPUPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_CPUPG_Pos)) /* Assignment of value for CPUPG in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_CPUQOS_Pos              _UINT32_(2)                                          /* (CFG_CFGPGQOS1) CPU I/D and System Bus QOS Control Position */
#define CFG_CFGPGQOS1_CPUQOS_Msk              (_UINT32_(0x3) << CFG_CFGPGQOS1_CPUQOS_Pos)          /* (CFG_CFGPGQOS1) CPU I/D and System Bus QOS Control Mask */
#define CFG_CFGPGQOS1_CPUQOS(value)           (CFG_CFGPGQOS1_CPUQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_CPUQOS_Pos)) /* Assignment of value for CPUQOS in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_DMAPG_Pos               _UINT32_(8)                                          /* (CFG_CFGPGQOS1) DMA (Rd/Wr) Permission Group Position */
#define CFG_CFGPGQOS1_DMAPG_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS1_DMAPG_Pos)           /* (CFG_CFGPGQOS1) DMA (Rd/Wr) Permission Group Mask */
#define CFG_CFGPGQOS1_DMAPG(value)            (CFG_CFGPGQOS1_DMAPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_DMAPG_Pos)) /* Assignment of value for DMAPG in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_CRYPTOPG_Pos            _UINT32_(20)                                         /* (CFG_CFGPGQOS1) Crypto Permission Group Position */
#define CFG_CFGPGQOS1_CRYPTOPG_Msk            (_UINT32_(0x3) << CFG_CFGPGQOS1_CRYPTOPG_Pos)        /* (CFG_CFGPGQOS1) Crypto Permission Group Mask */
#define CFG_CFGPGQOS1_CRYPTOPG(value)         (CFG_CFGPGQOS1_CRYPTOPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_CRYPTOPG_Pos)) /* Assignment of value for CRYPTOPG in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_CRYPTOQOS_Pos           _UINT32_(22)                                         /* (CFG_CFGPGQOS1) Crypto QOS Control Position */
#define CFG_CFGPGQOS1_CRYPTOQOS_Msk           (_UINT32_(0x3) << CFG_CFGPGQOS1_CRYPTOQOS_Pos)       /* (CFG_CFGPGQOS1) Crypto QOS Control Mask */
#define CFG_CFGPGQOS1_CRYPTOQOS(value)        (CFG_CFGPGQOS1_CRYPTOQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_CRYPTOQOS_Pos)) /* Assignment of value for CRYPTOQOS in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_DSUPG_Pos               _UINT32_(24)                                         /* (CFG_CFGPGQOS1) DSU Permission Group Position */
#define CFG_CFGPGQOS1_DSUPG_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS1_DSUPG_Pos)           /* (CFG_CFGPGQOS1) DSU Permission Group Mask */
#define CFG_CFGPGQOS1_DSUPG(value)            (CFG_CFGPGQOS1_DSUPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_DSUPG_Pos)) /* Assignment of value for DSUPG in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_FCQOS_Pos               _UINT32_(28)                                         /* (CFG_CFGPGQOS1) FC Controller QOS Control Position */
#define CFG_CFGPGQOS1_FCQOS_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS1_FCQOS_Pos)           /* (CFG_CFGPGQOS1) FC Controller QOS Control Mask */
#define CFG_CFGPGQOS1_FCQOS(value)            (CFG_CFGPGQOS1_FCQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_FCQOS_Pos)) /* Assignment of value for FCQOS in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_WISIBQOS_Pos            _UINT32_(30)                                         /* (CFG_CFGPGQOS1) Wireless SIB QOS Control Position */
#define CFG_CFGPGQOS1_WISIBQOS_Msk            (_UINT32_(0x3) << CFG_CFGPGQOS1_WISIBQOS_Pos)        /* (CFG_CFGPGQOS1) Wireless SIB QOS Control Mask */
#define CFG_CFGPGQOS1_WISIBQOS(value)         (CFG_CFGPGQOS1_WISIBQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS1_WISIBQOS_Pos)) /* Assignment of value for WISIBQOS in the CFG_CFGPGQOS1 register */
#define CFG_CFGPGQOS1_Msk                     _UINT32_(0xF3F0030F)                                 /* (CFG_CFGPGQOS1) Register Mask  */


/* -------- CFG_CFGPGQOS1CLR : (CFG Offset: 0x54) (R/W 32) Bit clear register -------- */
#define CFG_CFGPGQOS1CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (CFG_CFGPGQOS1CLR) Bit clear register  Reset Value */

#define CFG_CFGPGQOS1CLR_Msk                  _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOS1CLR) Register Mask  */


/* -------- CFG_CFGPGQOS1SET : (CFG Offset: 0x58) (R/W 32) Bit set register -------- */
#define CFG_CFGPGQOS1SET_RESETVALUE           _UINT32_(0x00)                                       /*  (CFG_CFGPGQOS1SET) Bit set register  Reset Value */

#define CFG_CFGPGQOS1SET_Msk                  _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOS1SET) Register Mask  */


/* -------- CFG_CFGPGQOS1INV : (CFG Offset: 0x5C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPGQOS1INV_RESETVALUE           _UINT32_(0x00)                                       /*  (CFG_CFGPGQOS1INV) Bit invert register  Reset Value */

