Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define CFG_CFGPGQOS1INV_Msk                  _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOS1INV) Register Mask  */


/* -------- CFG_CFGPGQOS2 : (CFG Offset: 0x60) (R/W 32)  -------- */
#define CFG_CFGPGQOS2_RESETVALUE              _UINT32_(0x84444)                                    /*  (CFG_CFGPGQOS2)   Reset Value */

#define CFG_CFGPGQOS2_ADCPG_Pos               _UINT32_(0)                                          /* (CFG_CFGPGQOS2) ADC Permission Group Position */
#define CFG_CFGPGQOS2_ADCPG_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS2_ADCPG_Pos)           /* (CFG_CFGPGQOS2) ADC Permission Group Mask */
#define CFG_CFGPGQOS2_ADCPG(value)            (CFG_CFGPGQOS2_ADCPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_ADCPG_Pos)) /* Assignment of value for ADCPG in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_ADCQOS_Pos              _UINT32_(2)                                          /* (CFG_CFGPGQOS2) ADC QOS Control bits Position */
#define CFG_CFGPGQOS2_ADCQOS_Msk              (_UINT32_(0x3) << CFG_CFGPGQOS2_ADCQOS_Pos)          /* (CFG_CFGPGQOS2) ADC QOS Control bits Mask */
#define CFG_CFGPGQOS2_ADCQOS(value)           (CFG_CFGPGQOS2_ADCQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_ADCQOS_Pos)) /* Assignment of value for ADCQOS in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_USBPG_Pos               _UINT32_(4)                                          /* (CFG_CFGPGQOS2) USB Permission Group Position */
#define CFG_CFGPGQOS2_USBPG_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS2_USBPG_Pos)           /* (CFG_CFGPGQOS2) USB Permission Group Mask */
#define CFG_CFGPGQOS2_USBPG(value)            (CFG_CFGPGQOS2_USBPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_USBPG_Pos)) /* Assignment of value for USBPG in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_USBQOS_Pos              _UINT32_(6)                                          /* (CFG_CFGPGQOS2) USB QOS Control bits Position */
#define CFG_CFGPGQOS2_USBQOS_Msk              (_UINT32_(0x3) << CFG_CFGPGQOS2_USBQOS_Pos)          /* (CFG_CFGPGQOS2) USB QOS Control bits Mask */
#define CFG_CFGPGQOS2_USBQOS(value)           (CFG_CFGPGQOS2_USBQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_USBQOS_Pos)) /* Assignment of value for USBQOS in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_CAN0PG_Pos              _UINT32_(8)                                          /* (CFG_CFGPGQOS2) CAN0 Permission Group Position */
#define CFG_CFGPGQOS2_CAN0PG_Msk              (_UINT32_(0x3) << CFG_CFGPGQOS2_CAN0PG_Pos)          /* (CFG_CFGPGQOS2) CAN0 Permission Group Mask */
#define CFG_CFGPGQOS2_CAN0PG(value)           (CFG_CFGPGQOS2_CAN0PG_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_CAN0PG_Pos)) /* Assignment of value for CAN0PG in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_CAN0QOS_Pos             _UINT32_(10)                                         /* (CFG_CFGPGQOS2) CAN0 QOS Control bits Position */
#define CFG_CFGPGQOS2_CAN0QOS_Msk             (_UINT32_(0x3) << CFG_CFGPGQOS2_CAN0QOS_Pos)         /* (CFG_CFGPGQOS2) CAN0 QOS Control bits Mask */
#define CFG_CFGPGQOS2_CAN0QOS(value)          (CFG_CFGPGQOS2_CAN0QOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_CAN0QOS_Pos)) /* Assignment of value for CAN0QOS in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_CAN1PG_Pos              _UINT32_(12)                                         /* (CFG_CFGPGQOS2) CAN1 Permission Group Position */
#define CFG_CFGPGQOS2_CAN1PG_Msk              (_UINT32_(0x3) << CFG_CFGPGQOS2_CAN1PG_Pos)          /* (CFG_CFGPGQOS2) CAN1 Permission Group Mask */
#define CFG_CFGPGQOS2_CAN1PG(value)           (CFG_CFGPGQOS2_CAN1PG_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_CAN1PG_Pos)) /* Assignment of value for CAN1PG in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_CAN1QOS_Pos             _UINT32_(14)                                         /* (CFG_CFGPGQOS2) CAN1 QOS Control bits Position */
#define CFG_CFGPGQOS2_CAN1QOS_Msk             (_UINT32_(0x3) << CFG_CFGPGQOS2_CAN1QOS_Pos)         /* (CFG_CFGPGQOS2) CAN1 QOS Control bits Mask */
#define CFG_CFGPGQOS2_CAN1QOS(value)          (CFG_CFGPGQOS2_CAN1QOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_CAN1QOS_Pos)) /* Assignment of value for CAN1QOS in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_ETHPG_Pos               _UINT32_(16)                                         /* (CFG_CFGPGQOS2) ETH Permission Group Position */
#define CFG_CFGPGQOS2_ETHPG_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS2_ETHPG_Pos)           /* (CFG_CFGPGQOS2) ETH Permission Group Mask */
#define CFG_CFGPGQOS2_ETHPG(value)            (CFG_CFGPGQOS2_ETHPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_ETHPG_Pos)) /* Assignment of value for ETHPG in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_ETHQOS_Pos              _UINT32_(18)                                         /* (CFG_CFGPGQOS2) ETH QOS Control bits Position */
#define CFG_CFGPGQOS2_ETHQOS_Msk              (_UINT32_(0x3) << CFG_CFGPGQOS2_ETHQOS_Pos)          /* (CFG_CFGPGQOS2) ETH QOS Control bits Mask */
#define CFG_CFGPGQOS2_ETHQOS(value)           (CFG_CFGPGQOS2_ETHQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS2_ETHQOS_Pos)) /* Assignment of value for ETHQOS in the CFG_CFGPGQOS2 register */
#define CFG_CFGPGQOS2_Msk                     _UINT32_(0x000FFFFF)                                 /* (CFG_CFGPGQOS2) Register Mask  */


/* -------- CFG_CFGPGQOS2CLR : (CFG Offset: 0x64) (R/W 32) Bit clear register -------- */
#define CFG_CFGPGQOS2CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (CFG_CFGPGQOS2CLR) Bit clear register  Reset Value */

#define CFG_CFGPGQOS2CLR_Msk                  _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOS2CLR) Register Mask  */


/* -------- CFG_CFGPGQOS2SET : (CFG Offset: 0x68) (R/W 32) Bit set register -------- */
#define CFG_CFGPGQOS2SET_RESETVALUE           _UINT32_(0x00)                                       /*  (CFG_CFGPGQOS2SET) Bit set register  Reset Value */

#define CFG_CFGPGQOS2SET_Msk                  _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOS2SET) Register Mask  */


/* -------- CFG_CFGPGQOS2INV : (CFG Offset: 0x6C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPGQOS2INV_RESETVALUE           _UINT32_(0x00)                                       /*  (CFG_CFGPGQOS2INV) Bit invert register  Reset Value */

#define CFG_CFGPGQOS2INV_Msk                  _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOS2INV) Register Mask  */


/* -------- CFG_CFGI2C : (CFG Offset: 0x70) (R/W 32)  -------- */
#define CFG_CFGI2C_RESETVALUE                 _UINT32_(0x00)                                       /*  (CFG_CFGI2C)   Reset Value */

