Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define CFG_CFGI2C_SMBUSEN0_Pos               _UINT32_(0)                                          /* (CFG_CFGI2C) SMBus Enable for SERCOM0 Position */
#define CFG_CFGI2C_SMBUSEN0_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SMBUSEN0_Pos)           /* (CFG_CFGI2C) SMBus Enable for SERCOM0 Mask */
#define CFG_CFGI2C_SMBUSEN0(value)            (CFG_CFGI2C_SMBUSEN0_Msk & (_UINT32_(value) << CFG_CFGI2C_SMBUSEN0_Pos)) /* Assignment of value for SMBUSEN0 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SMBUSEN1_Pos               _UINT32_(1)                                          /* (CFG_CFGI2C) SMBus Enable for SERCOM1 Position */
#define CFG_CFGI2C_SMBUSEN1_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SMBUSEN1_Pos)           /* (CFG_CFGI2C) SMBus Enable for SERCOM1 Mask */
#define CFG_CFGI2C_SMBUSEN1(value)            (CFG_CFGI2C_SMBUSEN1_Msk & (_UINT32_(value) << CFG_CFGI2C_SMBUSEN1_Pos)) /* Assignment of value for SMBUSEN1 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SMBUSEN2_Pos               _UINT32_(2)                                          /* (CFG_CFGI2C) SMBus Enable for SERCOM2 Position */
#define CFG_CFGI2C_SMBUSEN2_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SMBUSEN2_Pos)           /* (CFG_CFGI2C) SMBus Enable for SERCOM2 Mask */
#define CFG_CFGI2C_SMBUSEN2(value)            (CFG_CFGI2C_SMBUSEN2_Msk & (_UINT32_(value) << CFG_CFGI2C_SMBUSEN2_Pos)) /* Assignment of value for SMBUSEN2 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SMBUSEN6_Pos               _UINT32_(6)                                          /* (CFG_CFGI2C) SMBus Enable for SERCOM6 Position */
#define CFG_CFGI2C_SMBUSEN6_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SMBUSEN6_Pos)           /* (CFG_CFGI2C) SMBus Enable for SERCOM6 Mask */
#define CFG_CFGI2C_SMBUSEN6(value)            (CFG_CFGI2C_SMBUSEN6_Msk & (_UINT32_(value) << CFG_CFGI2C_SMBUSEN6_Pos)) /* Assignment of value for SMBUSEN6 in the CFG_CFGI2C register */
#define CFG_CFGI2C_I2CDSEL0_Pos               _UINT32_(8)                                          /* (CFG_CFGI2C) I2C Delay Select for SERCOM0 Position */
#define CFG_CFGI2C_I2CDSEL0_Msk               (_UINT32_(0x1) << CFG_CFGI2C_I2CDSEL0_Pos)           /* (CFG_CFGI2C) I2C Delay Select for SERCOM0 Mask */
#define CFG_CFGI2C_I2CDSEL0(value)            (CFG_CFGI2C_I2CDSEL0_Msk & (_UINT32_(value) << CFG_CFGI2C_I2CDSEL0_Pos)) /* Assignment of value for I2CDSEL0 in the CFG_CFGI2C register */
#define CFG_CFGI2C_I2CDSEL1_Pos               _UINT32_(9)                                          /* (CFG_CFGI2C) I2C Delay Select for SERCOM1 Position */
#define CFG_CFGI2C_I2CDSEL1_Msk               (_UINT32_(0x1) << CFG_CFGI2C_I2CDSEL1_Pos)           /* (CFG_CFGI2C) I2C Delay Select for SERCOM1 Mask */
#define CFG_CFGI2C_I2CDSEL1(value)            (CFG_CFGI2C_I2CDSEL1_Msk & (_UINT32_(value) << CFG_CFGI2C_I2CDSEL1_Pos)) /* Assignment of value for I2CDSEL1 in the CFG_CFGI2C register */
#define CFG_CFGI2C_I2CDSEL2_Pos               _UINT32_(10)                                         /* (CFG_CFGI2C) I2C Delay Select for SERCOM2 Position */
#define CFG_CFGI2C_I2CDSEL2_Msk               (_UINT32_(0x1) << CFG_CFGI2C_I2CDSEL2_Pos)           /* (CFG_CFGI2C) I2C Delay Select for SERCOM2 Mask */
#define CFG_CFGI2C_I2CDSEL2(value)            (CFG_CFGI2C_I2CDSEL2_Msk & (_UINT32_(value) << CFG_CFGI2C_I2CDSEL2_Pos)) /* Assignment of value for I2CDSEL2 in the CFG_CFGI2C register */
#define CFG_CFGI2C_I2CDSEL6_Pos               _UINT32_(14)                                         /* (CFG_CFGI2C) I2C Delay Select for SERCOM6 Position */
#define CFG_CFGI2C_I2CDSEL6_Msk               (_UINT32_(0x1) << CFG_CFGI2C_I2CDSEL6_Pos)           /* (CFG_CFGI2C) I2C Delay Select for SERCOM6 Mask */
#define CFG_CFGI2C_I2CDSEL6(value)            (CFG_CFGI2C_I2CDSEL6_Msk & (_UINT32_(value) << CFG_CFGI2C_I2CDSEL6_Pos)) /* Assignment of value for I2CDSEL6 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRCTRL0_Pos               _UINT32_(16)                                         /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM0 Position */
#define CFG_CFGI2C_SLRCTRL0_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SLRCTRL0_Pos)           /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM0 Mask */
#define CFG_CFGI2C_SLRCTRL0(value)            (CFG_CFGI2C_SLRCTRL0_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRCTRL0_Pos)) /* Assignment of value for SLRCTRL0 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRCTRL1_Pos               _UINT32_(17)                                         /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM1 Position */
#define CFG_CFGI2C_SLRCTRL1_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SLRCTRL1_Pos)           /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM1 Mask */
#define CFG_CFGI2C_SLRCTRL1(value)            (CFG_CFGI2C_SLRCTRL1_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRCTRL1_Pos)) /* Assignment of value for SLRCTRL1 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRCTRL2_Pos               _UINT32_(18)                                         /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM2 Position */
#define CFG_CFGI2C_SLRCTRL2_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SLRCTRL2_Pos)           /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM2 Mask */
#define CFG_CFGI2C_SLRCTRL2(value)            (CFG_CFGI2C_SLRCTRL2_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRCTRL2_Pos)) /* Assignment of value for SLRCTRL2 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRCTRL6_Pos               _UINT32_(22)                                         /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM6 Position */
#define CFG_CFGI2C_SLRCTRL6_Msk               (_UINT32_(0x1) << CFG_CFGI2C_SLRCTRL6_Pos)           /* (CFG_CFGI2C) I2C Slew Rate Control for SERCOM6 Mask */
#define CFG_CFGI2C_SLRCTRL6(value)            (CFG_CFGI2C_SLRCTRL6_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRCTRL6_Pos)) /* Assignment of value for SLRCTRL6 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRTEN0_Pos                _UINT32_(24)                                         /* (CFG_CFGI2C) SLRT Enable for SERCOM0 Position */
#define CFG_CFGI2C_SLRTEN0_Msk                (_UINT32_(0x1) << CFG_CFGI2C_SLRTEN0_Pos)            /* (CFG_CFGI2C) SLRT Enable for SERCOM0 Mask */
#define CFG_CFGI2C_SLRTEN0(value)             (CFG_CFGI2C_SLRTEN0_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRTEN0_Pos)) /* Assignment of value for SLRTEN0 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRTEN1_Pos                _UINT32_(25)                                         /* (CFG_CFGI2C) SLRT Enable for SERCOM1 Position */
#define CFG_CFGI2C_SLRTEN1_Msk                (_UINT32_(0x1) << CFG_CFGI2C_SLRTEN1_Pos)            /* (CFG_CFGI2C) SLRT Enable for SERCOM1 Mask */
#define CFG_CFGI2C_SLRTEN1(value)             (CFG_CFGI2C_SLRTEN1_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRTEN1_Pos)) /* Assignment of value for SLRTEN1 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRTEN2_Pos                _UINT32_(26)                                         /* (CFG_CFGI2C) SLRT Enable for SERCOM2 Position */
#define CFG_CFGI2C_SLRTEN2_Msk                (_UINT32_(0x1) << CFG_CFGI2C_SLRTEN2_Pos)            /* (CFG_CFGI2C) SLRT Enable for SERCOM2 Mask */
#define CFG_CFGI2C_SLRTEN2(value)             (CFG_CFGI2C_SLRTEN2_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRTEN2_Pos)) /* Assignment of value for SLRTEN2 in the CFG_CFGI2C register */
#define CFG_CFGI2C_SLRTEN6_Pos                _UINT32_(30)                                         /* (CFG_CFGI2C) SLRT Enable for SERCOM6 Position */
#define CFG_CFGI2C_SLRTEN6_Msk                (_UINT32_(0x1) << CFG_CFGI2C_SLRTEN6_Pos)            /* (CFG_CFGI2C) SLRT Enable for SERCOM6 Mask */
#define CFG_CFGI2C_SLRTEN6(value)             (CFG_CFGI2C_SLRTEN6_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRTEN6_Pos)) /* Assignment of value for SLRTEN6 in the CFG_CFGI2C register */
#define CFG_CFGI2C_Msk                        _UINT32_(0x47474747)                                 /* (CFG_CFGI2C) Register Mask  */

