Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define CFG_CFGI2C_SMBUSEN_Pos                _UINT32_(0)                                          /* (CFG_CFGI2C Position) SMBus Enable for SERCOMx */
#define CFG_CFGI2C_SMBUSEN_Msk                (_UINT32_(0xF) << CFG_CFGI2C_SMBUSEN_Pos)            /* (CFG_CFGI2C Mask) SMBUSEN */
#define CFG_CFGI2C_SMBUSEN(value)             (CFG_CFGI2C_SMBUSEN_Msk & (_UINT32_(value) << CFG_CFGI2C_SMBUSEN_Pos)) 
#define CFG_CFGI2C_I2CDSEL_Pos                _UINT32_(8)                                          /* (CFG_CFGI2C Position) I2C Delay Select for SERCOMx */
#define CFG_CFGI2C_I2CDSEL_Msk                (_UINT32_(0xF) << CFG_CFGI2C_I2CDSEL_Pos)            /* (CFG_CFGI2C Mask) I2CDSEL */
#define CFG_CFGI2C_I2CDSEL(value)             (CFG_CFGI2C_I2CDSEL_Msk & (_UINT32_(value) << CFG_CFGI2C_I2CDSEL_Pos)) 
#define CFG_CFGI2C_SLRCTRL_Pos                _UINT32_(16)                                         /* (CFG_CFGI2C Position) I2C Slew Rate Control for SERCOMx */
#define CFG_CFGI2C_SLRCTRL_Msk                (_UINT32_(0xF) << CFG_CFGI2C_SLRCTRL_Pos)            /* (CFG_CFGI2C Mask) SLRCTRL */
#define CFG_CFGI2C_SLRCTRL(value)             (CFG_CFGI2C_SLRCTRL_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRCTRL_Pos)) 
#define CFG_CFGI2C_SLRTEN_Pos                 _UINT32_(24)                                         /* (CFG_CFGI2C Position) SLRT Enable for SERCOM6 */
#define CFG_CFGI2C_SLRTEN_Msk                 (_UINT32_(0xF) << CFG_CFGI2C_SLRTEN_Pos)             /* (CFG_CFGI2C Mask) SLRTEN */
#define CFG_CFGI2C_SLRTEN(value)              (CFG_CFGI2C_SLRTEN_Msk & (_UINT32_(value) << CFG_CFGI2C_SLRTEN_Pos)) 

/* -------- CFG_CFGI2CCLR : (CFG Offset: 0x74) (R/W 32) Bit clear register -------- */
#define CFG_CFGI2CCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (CFG_CFGI2CCLR) Bit clear register  Reset Value */

#define CFG_CFGI2CCLR_Msk                     _UINT32_(0x00000000)                                 /* (CFG_CFGI2CCLR) Register Mask  */


/* -------- CFG_CFGI2CSET : (CFG Offset: 0x78) (R/W 32) Bit set register -------- */
#define CFG_CFGI2CSET_RESETVALUE              _UINT32_(0x00)                                       /*  (CFG_CFGI2CSET) Bit set register  Reset Value */

#define CFG_CFGI2CSET_Msk                     _UINT32_(0x00000000)                                 /* (CFG_CFGI2CSET) Register Mask  */


/* -------- CFG_CFGI2CINV : (CFG Offset: 0x7C) (R/W 32) Bit invert register -------- */
#define CFG_CFGI2CINV_RESETVALUE              _UINT32_(0x00)                                       /*  (CFG_CFGI2CINV) Bit invert register  Reset Value */

#define CFG_CFGI2CINV_Msk                     _UINT32_(0x00000000)                                 /* (CFG_CFGI2CINV) Register Mask  */


/* -------- CFG_CFGPCLKGEN1 : (CFG Offset: 0x80) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN1_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1)   Reset Value */

#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos     _UINT32_(0)                                          /* (CFG_CFGPCLKGEN1) EIC/CCL Clock Selection Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Msk     (_UINT32_(0x7) << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) EIC/CCL Clock Selection Mask */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL(value)  (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos)) /* Assignment of value for EIC__CCL_CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_NO_CLK  (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO1   (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO1_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO2   (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO2_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO3   (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO3_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO4   (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO4_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO5   (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO5_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO6   (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_REFO6_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CSEL_LPCLK   (CFG_CFGPCLKGEN1_EIC__CCL_CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_EIC__CCL_CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CD_Pos       _UINT32_(3)                                          /* (CFG_CFGPCLKGEN1) EIC/CCL Clock Disable Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CD_Msk       (_UINT32_(0x1) << CFG_CFGPCLKGEN1_EIC__CCL_CD_Pos)   /* (CFG_CFGPCLKGEN1) EIC/CCL Clock Disable Mask */
#define CFG_CFGPCLKGEN1_EIC__CCL_CD(value)    (CFG_CFGPCLKGEN1_EIC__CCL_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_EIC__CCL_CD_Pos)) /* Assignment of value for EIC__CCL_CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CD_ON_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_EIC__CCL_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_EIC__CCL_CD_ON        (CFG_CFGPCLKGEN1_EIC__CCL_CD_ON_Val << CFG_CFGPCLKGEN1_EIC__CCL_CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position */
#define CFG_CFGPCLKGEN1_EIC__CCL_CD_OFF       (CFG_CFGPCLKGEN1_EIC__CCL_CD_OFF_Val << CFG_CFGPCLKGEN1_EIC__CCL_CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos    _UINT32_(4)                                          /* (CFG_CFGPCLKGEN1) FREQMRC Clock Selection Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Msk    (_UINT32_(0x7) << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) FREQMRC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL(value) (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos)) /* Assignment of value for FREQM_REF_CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_NO_CLK (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO1  (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO1_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO2  (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO2_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO3  (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO3_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO4  (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO4_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO5  (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO5_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO6  (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_REFO6_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CSEL_LPCLK  (CFG_CFGPCLKGEN1_FREQM_REF_CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_FREQM_REF_CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CD_Pos      _UINT32_(7)                                          /* (CFG_CFGPCLKGEN1) FREQMRC Clock Disable Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CD_Msk      (_UINT32_(0x1) << CFG_CFGPCLKGEN1_FREQM_REF_CD_Pos)  /* (CFG_CFGPCLKGEN1) FREQMRC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_FREQM_REF_CD(value)   (CFG_CFGPCLKGEN1_FREQM_REF_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_FREQM_REF_CD_Pos)) /* Assignment of value for FREQM_REF_CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CD_ON_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_FREQM_REF_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_FREQM_REF_CD_ON       (CFG_CFGPCLKGEN1_FREQM_REF_CD_ON_Val << CFG_CFGPCLKGEN1_FREQM_REF_CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position */
#define CFG_CFGPCLKGEN1_FREQM_REF_CD_OFF      (CFG_CFGPCLKGEN1_FREQM_REF_CD_OFF_Val << CFG_CFGPCLKGEN1_FREQM_REF_CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos    _UINT32_(8)                                          /* (CFG_CFGPCLKGEN1) FREQMMC Clock Selection Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Msk    (_UINT32_(0x7) << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) FREQMMC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL(value) (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos)) /* Assignment of value for FREQM_MSR_CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_NO_CLK (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO1  (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO1_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO2  (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO2_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO3  (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO3_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO4  (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO4_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO5  (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO5_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO6  (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_REFO6_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_LPCLK  (CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CD_Pos      _UINT32_(11)                                         /* (CFG_CFGPCLKGEN1) FREQMMC Clock Disable Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CD_Msk      (_UINT32_(0x1) << CFG_CFGPCLKGEN1_FREQM_MSR_CD_Pos)  /* (CFG_CFGPCLKGEN1) FREQMMC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CD(value)   (CFG_CFGPCLKGEN1_FREQM_MSR_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_FREQM_MSR_CD_Pos)) /* Assignment of value for FREQM_MSR_CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CD_ON_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_FREQM_MSR_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CD_ON       (CFG_CFGPCLKGEN1_FREQM_MSR_CD_ON_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position */
#define CFG_CFGPCLKGEN1_FREQM_MSR_CD_OFF      (CFG_CFGPCLKGEN1_FREQM_MSR_CD_OFF_Val << CFG_CFGPCLKGEN1_FREQM_MSR_CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos _UINT32_(12)                                         /* (CFG_CFGPCLKGEN1) SERCOM0/1/2 Clock Selection Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Msk (_UINT32_(0x7) << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) SERCOM0/1/2 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL(value) (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos)) /* Assignment of value for SERCOM_0_1_2_CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_NO_CLK (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO1 (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO1_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO2 (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO2_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO3 (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO3_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO4 (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO4_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO5 (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO5_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO6 (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_REFO6_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_LPCLK (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_Pos   _UINT32_(15)                                         /* (CFG_CFGPCLKGEN1) SERCOM0/1/2 Clock Disable Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_Msk   (_UINT32_(0x1) << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_Pos) /* (CFG_CFGPCLKGEN1) SERCOM0/1/2 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD(value) (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_Pos)) /* Assignment of value for SERCOM_0_1_2_CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_ON_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_ON    (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_ON_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_Pos) /* (CFG_CFGPCLKGEN1) Enable PGCLK Position */
#define CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_OFF   (CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_OFF_Val << CFG_CFGPCLKGEN1_SERCOM_0_1_2_CD_Pos) /* (CFG_CFGPCLKGEN1) Disable PGCLK Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos     _UINT32_(16)                                         /* (CFG_CFGPCLKGEN1) SERCOM6 Clock Selection Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Msk     (_UINT32_(0x7) << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) SERCOM6 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL(value)  (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos)) /* Assignment of value for SERCOM_6_CSEL in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_NO_CLK  (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) No Clock Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO1   (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO1_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO2   (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO2_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO3   (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO3_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO4   (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO4_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO5   (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO5_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO6   (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_REFO6_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CSEL_LPCLK   (CFG_CFGPCLKGEN1_SERCOM_6_CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_SERCOM_6_CSEL_Pos) /* (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CD_Pos       _UINT32_(19)                                         /* (CFG_CFGPCLKGEN1) SERCOM6 Clock Disable Position */
#define CFG_CFGPCLKGEN1_SERCOM_6_CD_Msk       (_UINT32_(0x1) << CFG_CFGPCLKGEN1_SERCOM_6_CD_Pos)   /* (CFG_CFGPCLKGEN1) SERCOM6 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_SERCOM_6_CD(value)    (CFG_CFGPCLKGEN1_SERCOM_6_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN1_SERCOM_6_CD_Pos)) /* Assignment of value for SERCOM_6_CD in the CFG_CFGPCLKGEN1 register */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CD_ON_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_SERCOM_6_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN1) Disable PGCLK  */
