Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
/* -------- CFG_CFGPCLKGEN1CLR : (CFG Offset: 0x84) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN1CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN1CLR_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN1CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN1SET : (CFG Offset: 0x88) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN1SET_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN1SET_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN1SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN1INV : (CFG Offset: 0x8C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN1INV_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1INV) Bit invert register  Reset Value */

#define CFG_CFGPCLKGEN1INV_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN1INV) Register Mask  */


/* -------- CFG_CFGPCLKGEN2 : (CFG Offset: 0x90) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN2_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN2)   Reset Value */

#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos      _UINT32_(0)                                          /* (CFG_CFGPCLKGEN2) EVSYSC1 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC1 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos)) /* Assignment of value for EVSYS_1_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_1_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_1_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CD_Pos        _UINT32_(3)                                          /* (CFG_CFGPCLKGEN2) EVSYSC1 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_1_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC1 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_1_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_1_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_1_CD_Pos)) /* Assignment of value for EVSYS_1_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_1_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_1_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_1_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_1_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_1_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_1_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_1_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos      _UINT32_(4)                                          /* (CFG_CFGPCLKGEN2) EVSYSC2 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC2 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos)) /* Assignment of value for EVSYS_2_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_2_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_2_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CD_Pos        _UINT32_(7)                                          /* (CFG_CFGPCLKGEN2) EVSYSC2 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_2_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC2 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_2_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_2_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_2_CD_Pos)) /* Assignment of value for EVSYS_2_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_2_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_2_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_2_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_2_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_2_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_2_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_2_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos      _UINT32_(8)                                          /* (CFG_CFGPCLKGEN2) EVSYSC3 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC3 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos)) /* Assignment of value for EVSYS_3_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_3_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_3_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CD_Pos        _UINT32_(11)                                         /* (CFG_CFGPCLKGEN2) EVSYSC3 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_3_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC3 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_3_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_3_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_3_CD_Pos)) /* Assignment of value for EVSYS_3_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_3_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_3_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_3_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_3_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_3_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_3_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_3_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos      _UINT32_(12)                                         /* (CFG_CFGPCLKGEN2) EVSYSC4 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC4 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos)) /* Assignment of value for EVSYS_4_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_4_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_4_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CD_Pos        _UINT32_(15)                                         /* (CFG_CFGPCLKGEN2) EVSYSC4 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_4_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC4 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_4_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_4_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_4_CD_Pos)) /* Assignment of value for EVSYS_4_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_4_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_4_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_4_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_4_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_4_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_4_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_4_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos      _UINT32_(16)                                         /* (CFG_CFGPCLKGEN2) EVSYSC5 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC5 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos)) /* Assignment of value for EVSYS_5_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_5_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_5_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CD_Pos        _UINT32_(19)                                         /* (CFG_CFGPCLKGEN2) EVSYSC5 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_5_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC5 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_5_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_5_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_5_CD_Pos)) /* Assignment of value for EVSYS_5_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_5_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_5_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_5_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_5_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_5_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_5_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_5_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos      _UINT32_(20)                                         /* (CFG_CFGPCLKGEN2) EVSYSC6 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC6 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos)) /* Assignment of value for EVSYS_6_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
