Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define   CFG_CFGPCLKGEN2_EVSYS_6_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_6_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_6_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CD_Pos        _UINT32_(23)                                         /* (CFG_CFGPCLKGEN2) EVSYSC6 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_6_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC6 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_6_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_6_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_6_CD_Pos)) /* Assignment of value for EVSYS_6_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_6_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_6_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_6_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_6_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_6_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_6_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_6_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos      _UINT32_(24)                                         /* (CFG_CFGPCLKGEN2) EVSYSC7 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC7 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos)) /* Assignment of value for EVSYS_7_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_7_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_7_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CD_Pos        _UINT32_(27)                                         /* (CFG_CFGPCLKGEN2) EVSYSC7 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_7_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC7 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_7_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_7_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_7_CD_Pos)) /* Assignment of value for EVSYS_7_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_7_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_7_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_7_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_7_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_7_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_7_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_7_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos      _UINT32_(28)                                         /* (CFG_CFGPCLKGEN2) EVSYSC8 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos)  /* (CFG_CFGPCLKGEN2) EVSYSC8 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL(value)   (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos)) /* Assignment of value for EVSYS_8_CSEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_NO_CLK   (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO1    (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO2    (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO3    (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO4    (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO5    (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO6    (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CSEL_LPCLK    (CFG_CFGPCLKGEN2_EVSYS_8_CSEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYS_8_CSEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CD_Pos        _UINT32_(31)                                         /* (CFG_CFGPCLKGEN2) EVSYSC8 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYS_8_CD_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC8 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYS_8_CD(value)     (CFG_CFGPCLKGEN2_EVSYS_8_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYS_8_CD_Pos)) /* Assignment of value for EVSYS_8_CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYS_8_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYS_8_CD_ON         (CFG_CFGPCLKGEN2_EVSYS_8_CD_ON_Val << CFG_CFGPCLKGEN2_EVSYS_8_CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position */
#define CFG_CFGPCLKGEN2_EVSYS_8_CD_OFF        (CFG_CFGPCLKGEN2_EVSYS_8_CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYS_8_CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position */
#define CFG_CFGPCLKGEN2_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGPCLKGEN2) Register Mask  */


