Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
/* -------- CFG_CFGPCLKGEN2CLR : (CFG Offset: 0x94) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN2CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN2CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN2CLR_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN2CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN2SET : (CFG Offset: 0x98) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN2SET_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN2SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN2SET_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN2SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN2INV : (CFG Offset: 0x9C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN2INV_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN2INV) Bit invert register  Reset Value */

#define CFG_CFGPCLKGEN2INV_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN2INV) Register Mask  */


/* -------- CFG_CFGPCLKGEN3 : (CFG Offset: 0xA0) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN3_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3)   Reset Value */

#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos      _UINT32_(0)                                          /* (CFG_CFGPCLKGEN3) EVSYSC9 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Msk      (_UINT32_(0x7) << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos)  /* (CFG_CFGPCLKGEN3) EVSYSC9 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL(value)   (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos)) /* Assignment of value for EVSYS_9_CSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_NO_CLK   (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO1    (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO2    (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO3    (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO4    (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO5    (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO6    (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CSEL_LPCLK    (CFG_CFGPCLKGEN3_EVSYS_9_CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYS_9_CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CD_Pos        _UINT32_(3)                                          /* (CFG_CFGPCLKGEN3) EVSYSC9 Clock Disable Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CD_Msk        (_UINT32_(0x1) << CFG_CFGPCLKGEN3_EVSYS_9_CD_Pos)    /* (CFG_CFGPCLKGEN3) EVSYSC9 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_EVSYS_9_CD(value)     (CFG_CFGPCLKGEN3_EVSYS_9_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_9_CD_Pos)) /* Assignment of value for EVSYS_9_CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CD_ON_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_EVSYS_9_CD_OFF_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_EVSYS_9_CD_ON         (CFG_CFGPCLKGEN3_EVSYS_9_CD_ON_Val << CFG_CFGPCLKGEN3_EVSYS_9_CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_EVSYS_9_CD_OFF        (CFG_CFGPCLKGEN3_EVSYS_9_CD_OFF_Val << CFG_CFGPCLKGEN3_EVSYS_9_CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos     _UINT32_(4)                                          /* (CFG_CFGPCLKGEN3) EVSYSC10 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Msk     (_UINT32_(0x7) << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) EVSYSC10 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL(value)  (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos)) /* Assignment of value for EVSYS_10_CSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_NO_CLK  (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO1   (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO2   (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO3   (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO4   (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO5   (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO6   (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CSEL_LPCLK   (CFG_CFGPCLKGEN3_EVSYS_10_CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYS_10_CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CD_Pos       _UINT32_(7)                                          /* (CFG_CFGPCLKGEN3) EVSYSC10 Clock Disable Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CD_Msk       (_UINT32_(0x1) << CFG_CFGPCLKGEN3_EVSYS_10_CD_Pos)   /* (CFG_CFGPCLKGEN3) EVSYSC10 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_EVSYS_10_CD(value)    (CFG_CFGPCLKGEN3_EVSYS_10_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_10_CD_Pos)) /* Assignment of value for EVSYS_10_CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CD_ON_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_EVSYS_10_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_EVSYS_10_CD_ON        (CFG_CFGPCLKGEN3_EVSYS_10_CD_ON_Val << CFG_CFGPCLKGEN3_EVSYS_10_CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_EVSYS_10_CD_OFF       (CFG_CFGPCLKGEN3_EVSYS_10_CD_OFF_Val << CFG_CFGPCLKGEN3_EVSYS_10_CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos     _UINT32_(8)                                          /* (CFG_CFGPCLKGEN3) EVSYSC11 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Msk     (_UINT32_(0x7) << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) EVSYSC11 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL(value)  (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos)) /* Assignment of value for EVSYS_11_CSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_NO_CLK  (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO1   (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO2   (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO3   (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO4   (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO5   (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO6   (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CSEL_LPCLK   (CFG_CFGPCLKGEN3_EVSYS_11_CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYS_11_CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CD_Pos       _UINT32_(11)                                         /* (CFG_CFGPCLKGEN3) EVSYSC11 Clock Disable Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CD_Msk       (_UINT32_(0x1) << CFG_CFGPCLKGEN3_EVSYS_11_CD_Pos)   /* (CFG_CFGPCLKGEN3) EVSYSC11 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_EVSYS_11_CD(value)    (CFG_CFGPCLKGEN3_EVSYS_11_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_11_CD_Pos)) /* Assignment of value for EVSYS_11_CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CD_ON_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_EVSYS_11_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_EVSYS_11_CD_ON        (CFG_CFGPCLKGEN3_EVSYS_11_CD_ON_Val << CFG_CFGPCLKGEN3_EVSYS_11_CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_EVSYS_11_CD_OFF       (CFG_CFGPCLKGEN3_EVSYS_11_CD_OFF_Val << CFG_CFGPCLKGEN3_EVSYS_11_CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos     _UINT32_(12)                                         /* (CFG_CFGPCLKGEN3) EVSYSC12 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Msk     (_UINT32_(0x7) << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) EVSYSC12 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL(value)  (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos)) /* Assignment of value for EVSYS_12_CSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_NO_CLK  (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO1   (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO2   (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO3   (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO4   (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO5   (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO6   (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CSEL_LPCLK   (CFG_CFGPCLKGEN3_EVSYS_12_CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYS_12_CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CD_Pos       _UINT32_(15)                                         /* (CFG_CFGPCLKGEN3) EVSYSC12 Clock Disable Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CD_Msk       (_UINT32_(0x1) << CFG_CFGPCLKGEN3_EVSYS_12_CD_Pos)   /* (CFG_CFGPCLKGEN3) EVSYSC12 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_EVSYS_12_CD(value)    (CFG_CFGPCLKGEN3_EVSYS_12_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_EVSYS_12_CD_Pos)) /* Assignment of value for EVSYS_12_CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CD_ON_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_EVSYS_12_CD_OFF_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_EVSYS_12_CD_ON        (CFG_CFGPCLKGEN3_EVSYS_12_CD_ON_Val << CFG_CFGPCLKGEN3_EVSYS_12_CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_EVSYS_12_CD_OFF       (CFG_CFGPCLKGEN3_EVSYS_12_CD_OFF_Val << CFG_CFGPCLKGEN3_EVSYS_12_CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_ACCSEL_Pos            _UINT32_(16)                                         /* (CFG_CFGPCLKGEN3) AC Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_ACCSEL_Msk            (_UINT32_(0x7) << CFG_CFGPCLKGEN3_ACCSEL_Pos)        /* (CFG_CFGPCLKGEN3) AC Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_ACCSEL(value)         (CFG_CFGPCLKGEN3_ACCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_ACCSEL_Pos)) /* Assignment of value for ACCSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_ACCSEL_NO_CLK_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_ACCSEL_REFO1_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_ACCSEL_REFO2_Val    _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_ACCSEL_REFO3_Val    _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_ACCSEL_REFO4_Val    _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_ACCSEL_REFO5_Val    _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_ACCSEL_REFO6_Val    _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_ACCSEL_LPCLK_Val    _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_ACCSEL_NO_CLK         (CFG_CFGPCLKGEN3_ACCSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_ACCSEL_REFO1          (CFG_CFGPCLKGEN3_ACCSEL_REFO1_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_ACCSEL_REFO2          (CFG_CFGPCLKGEN3_ACCSEL_REFO2_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_ACCSEL_REFO3          (CFG_CFGPCLKGEN3_ACCSEL_REFO3_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_ACCSEL_REFO4          (CFG_CFGPCLKGEN3_ACCSEL_REFO4_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_ACCSEL_REFO5          (CFG_CFGPCLKGEN3_ACCSEL_REFO5_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_ACCSEL_REFO6          (CFG_CFGPCLKGEN3_ACCSEL_REFO6_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_ACCSEL_LPCLK          (CFG_CFGPCLKGEN3_ACCSEL_LPCLK_Val << CFG_CFGPCLKGEN3_ACCSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_ACCD_Pos              _UINT32_(19)                                         /* (CFG_CFGPCLKGEN3) AC Clock Disable Position */
#define CFG_CFGPCLKGEN3_ACCD_Msk              (_UINT32_(0x1) << CFG_CFGPCLKGEN3_ACCD_Pos)          /* (CFG_CFGPCLKGEN3) AC Clock Disable Mask */
#define CFG_CFGPCLKGEN3_ACCD(value)           (CFG_CFGPCLKGEN3_ACCD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_ACCD_Pos)) /* Assignment of value for ACCD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_ACCD_ON_Val         _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_ACCD_OFF_Val        _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_ACCD_ON               (CFG_CFGPCLKGEN3_ACCD_ON_Val << CFG_CFGPCLKGEN3_ACCD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_ACCD_OFF              (CFG_CFGPCLKGEN3_ACCD_OFF_Val << CFG_CFGPCLKGEN3_ACCD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos        _UINT32_(20)                                         /* (CFG_CFGPCLKGEN3) TCC0 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos)    /* (CFG_CFGPCLKGEN3) TCC0 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL(value)     (CFG_CFGPCLKGEN3_TCC_0_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos)) /* Assignment of value for TCC_0_CSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_TCC_0_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
