Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_NO_CLK     (CFG_CFGPCLKGEN3_TCC_0_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO1      (CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO2      (CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO3      (CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO4      (CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO5      (CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO6      (CFG_CFGPCLKGEN3_TCC_0_CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_TCC_0_CSEL_LPCLK      (CFG_CFGPCLKGEN3_TCC_0_CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TCC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_TCC_0_CD_Pos          _UINT32_(23)                                         /* (CFG_CFGPCLKGEN3) TCC0 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TCC_0_CD_Msk          (_UINT32_(0x1) << CFG_CFGPCLKGEN3_TCC_0_CD_Pos)      /* (CFG_CFGPCLKGEN3) TCC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TCC_0_CD(value)       (CFG_CFGPCLKGEN3_TCC_0_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TCC_0_CD_Pos)) /* Assignment of value for TCC_0_CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TCC_0_CD_ON_Val     _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TCC_0_CD_OFF_Val    _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TCC_0_CD_ON           (CFG_CFGPCLKGEN3_TCC_0_CD_ON_Val << CFG_CFGPCLKGEN3_TCC_0_CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_TCC_0_CD_OFF          (CFG_CFGPCLKGEN3_TCC_0_CD_OFF_Val << CFG_CFGPCLKGEN3_TCC_0_CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_Pos           _UINT32_(24)                                         /* (CFG_CFGPCLKGEN3) Ethernet Clock Selection Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN3_ETHCSEL_Pos)       /* (CFG_CFGPCLKGEN3) Ethernet Clock Selection Mask */
#define CFG_CFGPCLKGEN3_ETHCSEL(value)        (CFG_CFGPCLKGEN3_ETHCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_ETHCSEL_Pos)) /* Assignment of value for ETHCSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_ETHCSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_ETHCSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_ETHCSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_ETHCSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_ETHCSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_ETHCSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_ETHCSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_ETHCSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_ETHCSEL_NO_CLK        (CFG_CFGPCLKGEN3_ETHCSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_REFO1         (CFG_CFGPCLKGEN3_ETHCSEL_REFO1_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_REFO2         (CFG_CFGPCLKGEN3_ETHCSEL_REFO2_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_REFO3         (CFG_CFGPCLKGEN3_ETHCSEL_REFO3_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_REFO4         (CFG_CFGPCLKGEN3_ETHCSEL_REFO4_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_REFO5         (CFG_CFGPCLKGEN3_ETHCSEL_REFO5_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_REFO6         (CFG_CFGPCLKGEN3_ETHCSEL_REFO6_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_ETHCSEL_LPCLK         (CFG_CFGPCLKGEN3_ETHCSEL_LPCLK_Val << CFG_CFGPCLKGEN3_ETHCSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_ETHCD_Pos             _UINT32_(27)                                         /* (CFG_CFGPCLKGEN3) Ethernet Clock Disable Position */
#define CFG_CFGPCLKGEN3_ETHCD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN3_ETHCD_Pos)         /* (CFG_CFGPCLKGEN3) Ethernet Clock Disable Mask */
#define CFG_CFGPCLKGEN3_ETHCD(value)          (CFG_CFGPCLKGEN3_ETHCD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_ETHCD_Pos)) /* Assignment of value for ETHCD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_ETHCD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_ETHCD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_ETHCD_ON              (CFG_CFGPCLKGEN3_ETHCD_ON_Val << CFG_CFGPCLKGEN3_ETHCD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_ETHCD_OFF             (CFG_CFGPCLKGEN3_ETHCD_OFF_Val << CFG_CFGPCLKGEN3_ETHCD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_Pos           _UINT32_(28)                                         /* (CFG_CFGPCLKGEN3) CVD Selection Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN3_CVDCSEL_Pos)       /* (CFG_CFGPCLKGEN3) CVD Selection Mask */
#define CFG_CFGPCLKGEN3_CVDCSEL(value)        (CFG_CFGPCLKGEN3_CVDCSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_CVDCSEL_Pos)) /* Assignment of value for CVDCSEL in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_CVDCSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_CVDCSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_CVDCSEL_NO_CLK        (CFG_CFGPCLKGEN3_CVDCSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) No Clock Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO1         (CFG_CFGPCLKGEN3_CVDCSEL_REFO1_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO2         (CFG_CFGPCLKGEN3_CVDCSEL_REFO2_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO3         (CFG_CFGPCLKGEN3_CVDCSEL_REFO3_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO4         (CFG_CFGPCLKGEN3_CVDCSEL_REFO4_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO5         (CFG_CFGPCLKGEN3_CVDCSEL_REFO5_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_REFO6         (CFG_CFGPCLKGEN3_CVDCSEL_REFO6_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN3_CVDCSEL_LPCLK         (CFG_CFGPCLKGEN3_CVDCSEL_LPCLK_Val << CFG_CFGPCLKGEN3_CVDCSEL_Pos) /* (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN3_CVDCD_Pos             _UINT32_(31)                                         /* (CFG_CFGPCLKGEN3) CVD Clock Disable Position */
#define CFG_CFGPCLKGEN3_CVDCD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN3_CVDCD_Pos)         /* (CFG_CFGPCLKGEN3) CVD Clock Disable Mask */
#define CFG_CFGPCLKGEN3_CVDCD(value)          (CFG_CFGPCLKGEN3_CVDCD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_CVDCD_Pos)) /* Assignment of value for CVDCD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_CVDCD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_CVDCD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_CVDCD_ON              (CFG_CFGPCLKGEN3_CVDCD_ON_Val << CFG_CFGPCLKGEN3_CVDCD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position */
#define CFG_CFGPCLKGEN3_CVDCD_OFF             (CFG_CFGPCLKGEN3_CVDCD_OFF_Val << CFG_CFGPCLKGEN3_CVDCD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position */
#define CFG_CFGPCLKGEN3_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGPCLKGEN3) Register Mask  */


/* -------- CFG_CFGPCLKGEN3CLR : (CFG Offset: 0xA4) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN3CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN3CLR_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN3SET : (CFG Offset: 0xA8) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN3SET_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN3SET_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN3INV : (CFG Offset: 0xAC) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN3INV_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN3INV) Bit invert register  Reset Value */

