Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define CFG_CFGPCLKGEN3INV_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3INV) Register Mask  */


/* -------- CFG_CFGPCLKGEN4 : (CFG Offset: 0xB0) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN4_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN4)   Reset Value */

#define CFG_CFGPCLKGEN4_TC_0_CSEL_Pos         _UINT32_(0)                                          /* (CFG_CFGPCLKGEN4) TC0 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_Msk         (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos)     /* (CFG_CFGPCLKGEN4) TC0 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC_0_CSEL(value)      (CFG_CFGPCLKGEN4_TC_0_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos)) /* Assignment of value for TC_0_CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC_0_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_NO_CLK      (CFG_CFGPCLKGEN4_TC_0_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_REFO1       (CFG_CFGPCLKGEN4_TC_0_CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_REFO2       (CFG_CFGPCLKGEN4_TC_0_CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_REFO3       (CFG_CFGPCLKGEN4_TC_0_CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_REFO4       (CFG_CFGPCLKGEN4_TC_0_CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_REFO5       (CFG_CFGPCLKGEN4_TC_0_CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_REFO6       (CFG_CFGPCLKGEN4_TC_0_CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN4_TC_0_CSEL_LPCLK       (CFG_CFGPCLKGEN4_TC_0_CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC_0_CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN4_TC_0_CD_Pos           _UINT32_(3)                                          /* (CFG_CFGPCLKGEN4) TC0 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC_0_CD_Msk           (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC_0_CD_Pos)       /* (CFG_CFGPCLKGEN4) TC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC_0_CD(value)        (CFG_CFGPCLKGEN4_TC_0_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_0_CD_Pos)) /* Assignment of value for TC_0_CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_0_CD_ON_Val      _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC_0_CD_OFF_Val     _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC_0_CD_ON            (CFG_CFGPCLKGEN4_TC_0_CD_ON_Val << CFG_CFGPCLKGEN4_TC_0_CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_0_CD_OFF           (CFG_CFGPCLKGEN4_TC_0_CD_OFF_Val << CFG_CFGPCLKGEN4_TC_0_CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_Pos         _UINT32_(4)                                          /* (CFG_CFGPCLKGEN4) TC1 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_Msk         (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos)     /* (CFG_CFGPCLKGEN4) TC1 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC_1_CSEL(value)      (CFG_CFGPCLKGEN4_TC_1_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos)) /* Assignment of value for TC_1_CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC_1_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_NO_CLK      (CFG_CFGPCLKGEN4_TC_1_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_REFO1       (CFG_CFGPCLKGEN4_TC_1_CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_REFO2       (CFG_CFGPCLKGEN4_TC_1_CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_REFO3       (CFG_CFGPCLKGEN4_TC_1_CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_REFO4       (CFG_CFGPCLKGEN4_TC_1_CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_REFO5       (CFG_CFGPCLKGEN4_TC_1_CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_REFO6       (CFG_CFGPCLKGEN4_TC_1_CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN4_TC_1_CSEL_LPCLK       (CFG_CFGPCLKGEN4_TC_1_CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC_1_CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN4_TC_1_CD_Pos           _UINT32_(7)                                          /* (CFG_CFGPCLKGEN4) TC1 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC_1_CD_Msk           (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC_1_CD_Pos)       /* (CFG_CFGPCLKGEN4) TC1 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC_1_CD(value)        (CFG_CFGPCLKGEN4_TC_1_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_1_CD_Pos)) /* Assignment of value for TC_1_CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_1_CD_ON_Val      _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC_1_CD_OFF_Val     _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC_1_CD_ON            (CFG_CFGPCLKGEN4_TC_1_CD_ON_Val << CFG_CFGPCLKGEN4_TC_1_CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_1_CD_OFF           (CFG_CFGPCLKGEN4_TC_1_CD_OFF_Val << CFG_CFGPCLKGEN4_TC_1_CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos       _UINT32_(8)                                          /* (CFG_CFGPCLKGEN4) TC23 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_Msk       (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos)   /* (CFG_CFGPCLKGEN4) TC23 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL(value)    (CFG_CFGPCLKGEN4_TC_2_3_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos)) /* Assignment of value for TC_2_3_CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_NO_CLK    (CFG_CFGPCLKGEN4_TC_2_3_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO1     (CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO2     (CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO3     (CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO4     (CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO5     (CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO6     (CFG_CFGPCLKGEN4_TC_2_3_CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CSEL_LPCLK     (CFG_CFGPCLKGEN4_TC_2_3_CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC_2_3_CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CD_Pos         _UINT32_(11)                                         /* (CFG_CFGPCLKGEN4) TC23 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC_2_3_CD_Pos)     /* (CFG_CFGPCLKGEN4) TC23 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC_2_3_CD(value)      (CFG_CFGPCLKGEN4_TC_2_3_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_2_3_CD_Pos)) /* Assignment of value for TC_2_3_CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_2_3_CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC_2_3_CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC_2_3_CD_ON          (CFG_CFGPCLKGEN4_TC_2_3_CD_ON_Val << CFG_CFGPCLKGEN4_TC_2_3_CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_2_3_CD_OFF         (CFG_CFGPCLKGEN4_TC_2_3_CD_OFF_Val << CFG_CFGPCLKGEN4_TC_2_3_CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos       _UINT32_(12)                                         /* (CFG_CFGPCLKGEN4) TC45 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_Msk       (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos)   /* (CFG_CFGPCLKGEN4) TC45 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL(value)    (CFG_CFGPCLKGEN4_TC_4_5_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos)) /* Assignment of value for TC_4_5_CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_NO_CLK    (CFG_CFGPCLKGEN4_TC_4_5_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO1     (CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO2     (CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO3     (CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO4     (CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO5     (CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO6     (CFG_CFGPCLKGEN4_TC_4_5_CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CSEL_LPCLK     (CFG_CFGPCLKGEN4_TC_4_5_CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC_4_5_CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CD_Pos         _UINT32_(15)                                         /* (CFG_CFGPCLKGEN4) TC45 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC_4_5_CD_Pos)     /* (CFG_CFGPCLKGEN4) TC45 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC_4_5_CD(value)      (CFG_CFGPCLKGEN4_TC_4_5_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_4_5_CD_Pos)) /* Assignment of value for TC_4_5_CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_4_5_CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC_4_5_CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC_4_5_CD_ON          (CFG_CFGPCLKGEN4_TC_4_5_CD_ON_Val << CFG_CFGPCLKGEN4_TC_4_5_CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_4_5_CD_OFF         (CFG_CFGPCLKGEN4_TC_4_5_CD_OFF_Val << CFG_CFGPCLKGEN4_TC_4_5_CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos       _UINT32_(16)                                         /* (CFG_CFGPCLKGEN4) TC67 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_Msk       (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos)   /* (CFG_CFGPCLKGEN4) TC67 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL(value)    (CFG_CFGPCLKGEN4_TC_6_7_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos)) /* Assignment of value for TC_6_7_CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_NO_CLK    (CFG_CFGPCLKGEN4_TC_6_7_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO1     (CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO2     (CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO3     (CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO4     (CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO5     (CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO6     (CFG_CFGPCLKGEN4_TC_6_7_CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CSEL_LPCLK     (CFG_CFGPCLKGEN4_TC_6_7_CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC_6_7_CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CD_Pos         _UINT32_(19)                                         /* (CFG_CFGPCLKGEN4) TC67 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC_6_7_CD_Pos)     /* (CFG_CFGPCLKGEN4) TC67 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC_6_7_CD(value)      (CFG_CFGPCLKGEN4_TC_6_7_CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_6_7_CD_Pos)) /* Assignment of value for TC_6_7_CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_6_7_CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC_6_7_CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC_6_7_CD_ON          (CFG_CFGPCLKGEN4_TC_6_7_CD_ON_Val << CFG_CFGPCLKGEN4_TC_6_7_CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_6_7_CD_OFF         (CFG_CFGPCLKGEN4_TC_6_7_CD_OFF_Val << CFG_CFGPCLKGEN4_TC_6_7_CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos       _UINT32_(20)                                         /* (CFG_CFGPCLKGEN4) TC89 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_Msk       (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos)   /* (CFG_CFGPCLKGEN4) TC89 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL(value)    (CFG_CFGPCLKGEN4_TC_8_9_CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos)) /* Assignment of value for TC_8_9_CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC_8_9_CSEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_NO_CLK    (CFG_CFGPCLKGEN4_TC_8_9_CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO1     (CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO2     (CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO3     (CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO4     (CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO5     (CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position */
#define CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO6     (CFG_CFGPCLKGEN4_TC_8_9_CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC_8_9_CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position */
