Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cfg.h
#define CFG_PMD1INV_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD1INV) Register Mask  */


/* -------- CFG_PMD2 : (CFG Offset: 0xF0) (R/W 32)  -------- */
#define CFG_PMD2_RESETVALUE                   _UINT32_(0x00)                                       /*  (CFG_PMD2)   Reset Value */

#define CFG_PMD2_REFO5MD_Pos                  _UINT32_(24)                                         /* (CFG_PMD2) Reference (Clock) Out 5 Module Disable Position */
#define CFG_PMD2_REFO5MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO5MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 5 Module Disable Mask */
#define CFG_PMD2_REFO5MD(value)               (CFG_PMD2_REFO5MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO5MD_Pos)) /* Assignment of value for REFO5MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO6MD_Pos                  _UINT32_(25)                                         /* (CFG_PMD2) Reference (Clock) Out 6 Module Disable Position */
#define CFG_PMD2_REFO6MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO6MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 6 Module Disable Mask */
#define CFG_PMD2_REFO6MD(value)               (CFG_PMD2_REFO6MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO6MD_Pos)) /* Assignment of value for REFO6MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO1MD_Pos                  _UINT32_(28)                                         /* (CFG_PMD2) Reference (Clock) Out 1 Module Disable Position */
#define CFG_PMD2_REFO1MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO1MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 1 Module Disable Mask */
#define CFG_PMD2_REFO1MD(value)               (CFG_PMD2_REFO1MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO1MD_Pos)) /* Assignment of value for REFO1MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO2MD_Pos                  _UINT32_(29)                                         /* (CFG_PMD2) Reference (Clock) Out 2 Module Disable Position */
#define CFG_PMD2_REFO2MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO2MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 2 Module Disable Mask */
#define CFG_PMD2_REFO2MD(value)               (CFG_PMD2_REFO2MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO2MD_Pos)) /* Assignment of value for REFO2MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO3MD_Pos                  _UINT32_(30)                                         /* (CFG_PMD2) Reference (Clock) Out 3 Module Disable Position */
#define CFG_PMD2_REFO3MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO3MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 3 Module Disable Mask */
#define CFG_PMD2_REFO3MD(value)               (CFG_PMD2_REFO3MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO3MD_Pos)) /* Assignment of value for REFO3MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO4MD_Pos                  _UINT32_(31)                                         /* (CFG_PMD2) Reference (Clock) Out 4 Module Disable Position */
#define CFG_PMD2_REFO4MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO4MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 4 Module Disable Mask */
#define CFG_PMD2_REFO4MD(value)               (CFG_PMD2_REFO4MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO4MD_Pos)) /* Assignment of value for REFO4MD in the CFG_PMD2 register */
#define CFG_PMD2_Msk                          _UINT32_(0xF3000000)                                 /* (CFG_PMD2) Register Mask  */


/* -------- CFG_PMD2CLR : (CFG Offset: 0xF4) (R/W 32) Bit clear register -------- */
#define CFG_PMD2CLR_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD2CLR) Bit clear register  Reset Value */

#define CFG_PMD2CLR_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD2CLR) Register Mask  */


/* -------- CFG_PMD2SET : (CFG Offset: 0xF8) (R/W 32) Bit set register -------- */
#define CFG_PMD2SET_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD2SET) Bit set register  Reset Value */

#define CFG_PMD2SET_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD2SET) Register Mask  */


/* -------- CFG_PMD2INV : (CFG Offset: 0xFC) (R/W 32) Bit invert register -------- */
#define CFG_PMD2INV_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD2INV) Bit invert register  Reset Value */

#define CFG_PMD2INV_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD2INV) Register Mask  */


/* -------- CFG_PMD3 : (CFG Offset: 0x100) (R/W 32)  -------- */
#define CFG_PMD3_RESETVALUE                   _UINT32_(0x00)                                       /*  (CFG_PMD3)   Reset Value */

#define CFG_PMD3_SER0MD_Pos                   _UINT32_(0)                                          /* (CFG_PMD3) SERCOM0 Module Disable Position */
#define CFG_PMD3_SER0MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER0MD_Pos)               /* (CFG_PMD3) SERCOM0 Module Disable Mask */
#define CFG_PMD3_SER0MD(value)                (CFG_PMD3_SER0MD_Msk & (_UINT32_(value) << CFG_PMD3_SER0MD_Pos)) /* Assignment of value for SER0MD in the CFG_PMD3 register */
#define CFG_PMD3_SER1MD_Pos                   _UINT32_(1)                                          /* (CFG_PMD3) SERCOM1 Module Disable Position */
#define CFG_PMD3_SER1MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER1MD_Pos)               /* (CFG_PMD3) SERCOM1 Module Disable Mask */
#define CFG_PMD3_SER1MD(value)                (CFG_PMD3_SER1MD_Msk & (_UINT32_(value) << CFG_PMD3_SER1MD_Pos)) /* Assignment of value for SER1MD in the CFG_PMD3 register */
#define CFG_PMD3_SER2MD_Pos                   _UINT32_(2)                                          /* (CFG_PMD3) SERCOM2 Module Disable Position */
#define CFG_PMD3_SER2MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER2MD_Pos)               /* (CFG_PMD3) SERCOM2 Module Disable Mask */
#define CFG_PMD3_SER2MD(value)                (CFG_PMD3_SER2MD_Msk & (_UINT32_(value) << CFG_PMD3_SER2MD_Pos)) /* Assignment of value for SER2MD in the CFG_PMD3 register */
#define CFG_PMD3_SER3MD_Pos                   _UINT32_(3)                                          /* (CFG_PMD3) SERCOM3 Module Disable Position */
#define CFG_PMD3_SER3MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER3MD_Pos)               /* (CFG_PMD3) SERCOM3 Module Disable Mask */
#define CFG_PMD3_SER3MD(value)                (CFG_PMD3_SER3MD_Msk & (_UINT32_(value) << CFG_PMD3_SER3MD_Pos)) /* Assignment of value for SER3MD in the CFG_PMD3 register */
#define CFG_PMD3_SER4MD_Pos                   _UINT32_(4)                                          /* (CFG_PMD3) SERCOM4 Module Disable Position */
#define CFG_PMD3_SER4MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER4MD_Pos)               /* (CFG_PMD3) SERCOM4 Module Disable Mask */
#define CFG_PMD3_SER4MD(value)                (CFG_PMD3_SER4MD_Msk & (_UINT32_(value) << CFG_PMD3_SER4MD_Pos)) /* Assignment of value for SER4MD in the CFG_PMD3 register */
#define CFG_PMD3_SER5MD_Pos                   _UINT32_(5)                                          /* (CFG_PMD3) SERCOM5 Module Disable Position */
#define CFG_PMD3_SER5MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER5MD_Pos)               /* (CFG_PMD3) SERCOM5 Module Disable Mask */
#define CFG_PMD3_SER5MD(value)                (CFG_PMD3_SER5MD_Msk & (_UINT32_(value) << CFG_PMD3_SER5MD_Pos)) /* Assignment of value for SER5MD in the CFG_PMD3 register */
#define CFG_PMD3_SER6MD_Pos                   _UINT32_(6)                                          /* (CFG_PMD3) SERCOM6 Module Disable Position */
#define CFG_PMD3_SER6MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER6MD_Pos)               /* (CFG_PMD3) SERCOM6 Module Disable Mask */
#define CFG_PMD3_SER6MD(value)                (CFG_PMD3_SER6MD_Msk & (_UINT32_(value) << CFG_PMD3_SER6MD_Pos)) /* Assignment of value for SER6MD in the CFG_PMD3 register */
#define CFG_PMD3_QEIMD_Pos                    _UINT32_(7)                                          /* (CFG_PMD3) QEI Module Disable Position */
#define CFG_PMD3_QEIMD_Msk                    (_UINT32_(0x1) << CFG_PMD3_QEIMD_Pos)                /* (CFG_PMD3) QEI Module Disable Mask */
#define CFG_PMD3_QEIMD(value)                 (CFG_PMD3_QEIMD_Msk & (_UINT32_(value) << CFG_PMD3_QEIMD_Pos)) /* Assignment of value for QEIMD in the CFG_PMD3 register */
#define CFG_PMD3_TC0MD_Pos                    _UINT32_(8)                                          /* (CFG_PMD3) TC0 Module Disable Position */
#define CFG_PMD3_TC0MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC0MD_Pos)                /* (CFG_PMD3) TC0 Module Disable Mask */
#define CFG_PMD3_TC0MD(value)                 (CFG_PMD3_TC0MD_Msk & (_UINT32_(value) << CFG_PMD3_TC0MD_Pos)) /* Assignment of value for TC0MD in the CFG_PMD3 register */
#define CFG_PMD3_TC1MD_Pos                    _UINT32_(9)                                          /* (CFG_PMD3) TC1 Module Disable Position */
#define CFG_PMD3_TC1MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC1MD_Pos)                /* (CFG_PMD3) TC1 Module Disable Mask */
#define CFG_PMD3_TC1MD(value)                 (CFG_PMD3_TC1MD_Msk & (_UINT32_(value) << CFG_PMD3_TC1MD_Pos)) /* Assignment of value for TC1MD in the CFG_PMD3 register */
#define CFG_PMD3_TC2MD_Pos                    _UINT32_(10)                                         /* (CFG_PMD3) TC2 Module Disable Position */
#define CFG_PMD3_TC2MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC2MD_Pos)                /* (CFG_PMD3) TC2 Module Disable Mask */
#define CFG_PMD3_TC2MD(value)                 (CFG_PMD3_TC2MD_Msk & (_UINT32_(value) << CFG_PMD3_TC2MD_Pos)) /* Assignment of value for TC2MD in the CFG_PMD3 register */
#define CFG_PMD3_TC3MD_Pos                    _UINT32_(11)                                         /* (CFG_PMD3) TC3 Module Disable Position */
#define CFG_PMD3_TC3MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC3MD_Pos)                /* (CFG_PMD3) TC3 Module Disable Mask */
#define CFG_PMD3_TC3MD(value)                 (CFG_PMD3_TC3MD_Msk & (_UINT32_(value) << CFG_PMD3_TC3MD_Pos)) /* Assignment of value for TC3MD in the CFG_PMD3 register */
#define CFG_PMD3_TC4MD_Pos                    _UINT32_(12)                                         /* (CFG_PMD3) TC4 Module Disable Position */
#define CFG_PMD3_TC4MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC4MD_Pos)                /* (CFG_PMD3) TC4 Module Disable Mask */
#define CFG_PMD3_TC4MD(value)                 (CFG_PMD3_TC4MD_Msk & (_UINT32_(value) << CFG_PMD3_TC4MD_Pos)) /* Assignment of value for TC4MD in the CFG_PMD3 register */
#define CFG_PMD3_TC5MD_Pos                    _UINT32_(13)                                         /* (CFG_PMD3) TC5 Module Disable Position */
#define CFG_PMD3_TC5MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC5MD_Pos)                /* (CFG_PMD3) TC5 Module Disable Mask */
#define CFG_PMD3_TC5MD(value)                 (CFG_PMD3_TC5MD_Msk & (_UINT32_(value) << CFG_PMD3_TC5MD_Pos)) /* Assignment of value for TC5MD in the CFG_PMD3 register */
#define CFG_PMD3_TC6MD_Pos                    _UINT32_(14)                                         /* (CFG_PMD3) TC6 Module Disable Position */
#define CFG_PMD3_TC6MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC6MD_Pos)                /* (CFG_PMD3) TC6 Module Disable Mask */
#define CFG_PMD3_TC6MD(value)                 (CFG_PMD3_TC6MD_Msk & (_UINT32_(value) << CFG_PMD3_TC6MD_Pos)) /* Assignment of value for TC6MD in the CFG_PMD3 register */
#define CFG_PMD3_TC7MD_Pos                    _UINT32_(15)                                         /* (CFG_PMD3) TC7 Module Disable Position */
#define CFG_PMD3_TC7MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC7MD_Pos)                /* (CFG_PMD3) TC7 Module Disable Mask */
#define CFG_PMD3_TC7MD(value)                 (CFG_PMD3_TC7MD_Msk & (_UINT32_(value) << CFG_PMD3_TC7MD_Pos)) /* Assignment of value for TC7MD in the CFG_PMD3 register */
#define CFG_PMD3_TC8MD_Pos                    _UINT32_(16)                                         /* (CFG_PMD3) TC8 Module Disable Position */
#define CFG_PMD3_TC8MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC8MD_Pos)                /* (CFG_PMD3) TC8 Module Disable Mask */
#define CFG_PMD3_TC8MD(value)                 (CFG_PMD3_TC8MD_Msk & (_UINT32_(value) << CFG_PMD3_TC8MD_Pos)) /* Assignment of value for TC8MD in the CFG_PMD3 register */
#define CFG_PMD3_TC9MD_Pos                    _UINT32_(17)                                         /* (CFG_PMD3) TC9 Module Disable Position */
#define CFG_PMD3_TC9MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC9MD_Pos)                /* (CFG_PMD3) TC9 Module Disable Mask */
#define CFG_PMD3_TC9MD(value)                 (CFG_PMD3_TC9MD_Msk & (_UINT32_(value) << CFG_PMD3_TC9MD_Pos)) /* Assignment of value for TC9MD in the CFG_PMD3 register */
#define CFG_PMD3_TCC0MD_Pos                   _UINT32_(20)                                         /* (CFG_PMD3) TCC0 Module Disable Position */
#define CFG_PMD3_TCC0MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_TCC0MD_Pos)               /* (CFG_PMD3) TCC0 Module Disable Mask */
#define CFG_PMD3_TCC0MD(value)                (CFG_PMD3_TCC0MD_Msk & (_UINT32_(value) << CFG_PMD3_TCC0MD_Pos)) /* Assignment of value for TCC0MD in the CFG_PMD3 register */
#define CFG_PMD3_TCC1MD_Pos                   _UINT32_(21)                                         /* (CFG_PMD3) TCC1 Module Disable Position */
#define CFG_PMD3_TCC1MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_TCC1MD_Pos)               /* (CFG_PMD3) TCC1 Module Disable Mask */
#define CFG_PMD3_TCC1MD(value)                (CFG_PMD3_TCC1MD_Msk & (_UINT32_(value) << CFG_PMD3_TCC1MD_Pos)) /* Assignment of value for TCC1MD in the CFG_PMD3 register */
#define CFG_PMD3_TCC2MD_Pos                   _UINT32_(22)                                         /* (CFG_PMD3) TCC2 Module Disable Position */
#define CFG_PMD3_TCC2MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_TCC2MD_Pos)               /* (CFG_PMD3) TCC2 Module Disable Mask */
#define CFG_PMD3_TCC2MD(value)                (CFG_PMD3_TCC2MD_Msk & (_UINT32_(value) << CFG_PMD3_TCC2MD_Pos)) /* Assignment of value for TCC2MD in the CFG_PMD3 register */
#define CFG_PMD3_USBMD_Pos                    _UINT32_(24)                                         /* (CFG_PMD3) USB Module Disable Position */
#define CFG_PMD3_USBMD_Msk                    (_UINT32_(0x1) << CFG_PMD3_USBMD_Pos)                /* (CFG_PMD3) USB Module Disable Mask */
#define CFG_PMD3_USBMD(value)                 (CFG_PMD3_USBMD_Msk & (_UINT32_(value) << CFG_PMD3_USBMD_Pos)) /* Assignment of value for USBMD in the CFG_PMD3 register */
#define CFG_PMD3_ETHMD_Pos                    _UINT32_(25)                                         /* (CFG_PMD3) Ethernet Module Disable Position */
#define CFG_PMD3_ETHMD_Msk                    (_UINT32_(0x1) << CFG_PMD3_ETHMD_Pos)                /* (CFG_PMD3) Ethernet Module Disable Mask */
#define CFG_PMD3_ETHMD(value)                 (CFG_PMD3_ETHMD_Msk & (_UINT32_(value) << CFG_PMD3_ETHMD_Pos)) /* Assignment of value for ETHMD in the CFG_PMD3 register */
#define CFG_PMD3_CAN0MD_Pos                   _UINT32_(26)                                         /* (CFG_PMD3) CAN0 Module Disable Position */
#define CFG_PMD3_CAN0MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_CAN0MD_Pos)               /* (CFG_PMD3) CAN0 Module Disable Mask */
#define CFG_PMD3_CAN0MD(value)                (CFG_PMD3_CAN0MD_Msk & (_UINT32_(value) << CFG_PMD3_CAN0MD_Pos)) /* Assignment of value for CAN0MD in the CFG_PMD3 register */
#define CFG_PMD3_CAN1MD_Pos                   _UINT32_(27)                                         /* (CFG_PMD3) CAN1 Module Disable Position */
#define CFG_PMD3_CAN1MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_CAN1MD_Pos)               /* (CFG_PMD3) CAN1 Module Disable Mask */
#define CFG_PMD3_CAN1MD(value)                (CFG_PMD3_CAN1MD_Msk & (_UINT32_(value) << CFG_PMD3_CAN1MD_Pos)) /* Assignment of value for CAN1MD in the CFG_PMD3 register */
#define CFG_PMD3_Msk                          _UINT32_(0x0F73FFFF)                                 /* (CFG_PMD3) Register Mask  */


/* -------- CFG_PMD3CLR : (CFG Offset: 0x104) (R/W 32) Bit clear register -------- */
#define CFG_PMD3CLR_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD3CLR) Bit clear register  Reset Value */

